Repository: shoyeb017/SayHello_App_Fullstack_
Catalog: frontend_sayhello_app/lib/l10n/app_*.arb
Languages: bn, ko

# practiceLanguages
source: Practice 5+ languages
bn: ৫+ ভাষা অনুশীলন করুন
ko: 5가지 이상의 언어 연습

# meetFriends
source: Meet 50 million global friends
bn: ৫ কোটি বিশ্বব্যাপী বন্ধুদের সাথে পরিচিত হন
ko: 5천만 명의 글로벌 친구들과 만나기

# iAmLearner
source: I am a Learner
bn: আমি একজন শিক্ষার্থী
ko: 저는 학습자입니다

# iAmInstructor
source: I am an Instructor
bn: আমি একজন প্রশিক্ষক
ko: 저는 강사입니다

source: Terms of Service
bn: সেবার শর্তাবলী
ko: 서비스 약관

source: Privacy Policy
bn: গোপনীয়তা নীতি
ko: 개인정보 보호정책

# agreementText
source: Your first login creates your account, and in doing so you agree to our
bn: আপনার প্রথম লগইন আপনার অ্যাকাউন্ট তৈরি করে, এবং এটি করার মাধ্যমে আপনি আমাদের
ko: 첫 번째 로그인으로 계정이 생성되며, 이를 통해 우리의

source: and
bn: এবং
ko: 그리고

source: Hello,
bn: হ্যালো,
ko: 안녕하세요,

source: Language
bn: ভাষা
ko: 언어

source: Select Language
bn: ভাষা নির্বাচন করুন
ko: 언어 선택

source: Learner Sign In
bn: শিক্ষার্থী সাইন ইন
ko: 학습자 로그인

source: Instructor Sign In
bn: প্রশিক্ষক সাইন ইন
ko: 강사 로그인

source: Welcome back!
bn: ফিরে আসার জন্য স্বাগতম!
ko: 돌아오신 것을 환영합니다!

# signInToContinue
source: Sign in to continue learning.
bn: শেখা চালিয়ে যেতে সাইন ইন করুন।
ko: 학습을 계속하려면 로그인하세요.

source: Username
bn: ব্যবহারকারীর নাম
ko: 사용자명

source: Password
bn: পাসওয়ার্ড
ko: 비밀번호

source: Sign In
bn: সাইন ইন
ko: 로그인

source: Sign Up
bn: সাইন আপ
ko: 회원가입

source: Learner Sign Up
bn: শিক্ষার্থী নিবন্ধন
ko: 학습자 회원가입

source: Instructor Sign Up
bn: প্রশিক্ষক নিবন্ধন
ko: 강사 회원가입

source: Create Account
bn: অ্যাকাউন্ট তৈরি করুন
ko: 계정 만들기

# joinCommunity
source: Join our learning community.
bn: আমাদের শেখার সম্প্রদায়ে যোগ দিন।
ko: 우리의 학습 커뮤니티에 참여하세요.

source: Email
bn: ইমেইল
ko: 이메일

source: Confirm Password
bn: পাসওয়ার্ড নিশ্চিত করুন
ko: 비밀번호 확인

# alreadyHaveAccount
source: Already have an account?
bn: ইতিমধ্যে একটি অ্যাকাউন্ট আছে?
ko: 이미 계정이 있으신가요?

source: Welcome Instructor
bn: প্রশিক্ষক স্বাগতম
ko: 강사님 환영합니다

# signInToManageCourses
source: Please sign in to manage your courses.
bn: আপনার কোর্স পরিচালনা করতে সাইন ইন করুন।
ko: 강의를 관리하려면 로그인하세요.

source: Create your account
bn: আপনার অ্যাকাউন্ট তৈরি করুন
ko: 계정 만들기

source: Name
bn: নাম
ko: 이름

source: Native Language
bn: মাতৃভাষা
ko: 모국어

source: Learning Language
bn: শেখার ভাষা
ko: 학습 언어

source: Gender
bn: লিঙ্গ
ko: 성별

source: Country
bn: দেশ
ko: 국가

source: Bio
bn: পরিচিতি
ko: 자기소개

source: Male
bn: পুরুষ
ko: 남성

source: Female
bn: মহিলা
ko: 여성

source: Other
bn: অন্যান্য
ko: 기타

source: English
bn: ইংরেজি
ko: 영어

source: Arabic
bn: আরবি
ko: 아랍어

source: Japanese
bn: জাপানি
ko: 일본어

source: Bangla
bn: বাংলা
ko: 벵골어

source: Korean
bn: কোরিয়ান
ko: 한국어

source: Bengali
bn: বাংলা
ko: 벵골어

source: Language changed to
bn: ভাষা পরিবর্তন করা হয়েছে:
ko: 언어가 다음으로 변경됨:

source: Profile Photo
bn: প্রোফাইল ছবি
ko: 프로필 사진

source: Tap to add photo
bn: ছবি যোগ করতে ট্যাপ করুন
ko: 사진을 추가하려면 탭하세요

source: Home
bn: হোম
ko: 홈

source: Connect
bn: সংযোগ
ko: 연결

source: Feed
bn: ফিড
ko: 피드

source: Feedback
bn: প্রতিক্রিয়া
ko: 피드백

source: Learn
bn: শিখুন
ko: 학습

source: Profile
bn: প্রোফাইল
ko: 프로필

source: Save
bn: সংরক্ষণ
ko: 저장

source: Cancel
bn: বাতিল
ko: 취소

source: Edit
bn: সম্পাদনা
ko: 편집

source: Delete
bn: মুছুন
ko: 삭제

source: Settings
bn: সেটিংস
ko: 설정

source: Logout
bn: লগআউট
ko: 로그아웃

source: Step 1: Personal Info
bn: ধাপ ১: ব্যক্তিগত তথ্য
ko: 1단계: 개인 정보

source: Step 2: Language & Bio
bn: ধাপ ২: ভাষা ও পরিচয়
ko: 2단계: 언어 및 소개

source: Step 3: Additional Info
bn: ধাপ ৩: অতিরিক্ত তথ্য
ko: 3단계: 추가 정보

source: Full Name
bn: পূর্ণ নাম
ko: 성명

source: Date of Birth
bn: জন্ম তারিখ
ko: 생년월일

source: Choose DOB
bn: জন্ম তারিখ নির্বাচন করুন
ko: 생년월일 선택

source: Next
bn: পরবর্তী
ko: 다음

source: Back
bn: পিছনে
ko: 뒤로

source: Submit
bn: জমা দিন
ko: 제출

source: Required
bn: আবশ্যক
ko: 필수

source: Teaching Language
bn: শিক্ষাদানের ভাষা
ko: 교육 언어

source: Bio (Optional)
bn: পরিচয় (ঐচ্ছিক)
ko: 소개 (선택사항)

source: Instructor Registered Successfully!
bn: প্রশিক্ষক সফলভাবে নিবন্ধিত হয়েছেন!
ko: 강사 등록이 완료되었습니다!

source: Learner Registered Successfully!
bn: শিক্ষার্থী সফলভাবে নিবন্ধিত হয়েছেন!
ko: 학습자 등록이 완료되었습니다!

source: Skill Level
bn: দক্ষতার স্তর
ko: 실력 수준

source: Beginner
bn: প্রাথমিক
ko: 초급

source: Basic
bn: মৌলিক
ko: 기초

source: Intermediate
bn: মধ্যম
ko: 중급

source: Advanced
bn: উন্নত
ko: 고급

source: Fluent
bn: সাবলীল
ko: 유창함

source: Select Interests
bn: আগ্রহ নির্বাচন করুন
ko: 관심사 선택

source: Music
bn: সঙ্গীত
ko: 음악

source: Travel
bn: ভ্রমণ
ko: 여행

source: Books
bn: বই
ko: 책

source: Gaming
bn: গেমিং
ko: 게임

source: Cooking
bn: রান্না
ko: 요리

source: Movies
bn: চলচ্চিত্র
ko: 영화

source: Photography
bn: ফটোগ্রাফি
ko: 사진

source: Fitness
bn: ফিটনেস
ko: 피트니스

source: Art
bn: শিল্প
ko: 예술

source: Others
bn: অন্যান্য
ko: 기타

source: Bangladesh
bn: বাংলাদেশ
ko: 방글라데시

source: USA
bn: যুক্তরাষ্ট্র
ko: 미국

source: UK
bn: যুক্তরাজ্য
ko: 영국

source: India
bn: ভারত
ko: 인도

source: Japan
bn: জাপান
ko: 일본

source: Korea
bn: কোরিয়া
ko: 한국

source: Saudi Arabia
bn: সৌদি আরব
ko: 사우디아라비아

source: Step 2: Language Info
bn: ধাপ ২: ভাষার তথ্য
ko: 2단계: 언어 정보

# nativeLanguageShort
source: Native Language
bn: মাতৃভাষা
ko: 모국어

# learningLanguageShort
source: Learning Language
bn: শেখার ভাষা
ko: 학습 언어

source: Language Talks
bn: ভাষা আলোচনা
ko: 언어 대화

source: Last seen
bn: শেষ দেখা
ko: 마지막 접속

# typeMessage
source: Type a message...
bn: একটি বার্তা লিখুন...
ko: 메시지를 입력하세요...

source: Just now
bn: এখনই
ko: 방금 전

# minutesAgo
source: {minutes}m ago
bn: {minutes} মিনিট আগে
ko: {minutes}분 전

# hoursAgo
source: {hours}h ago
bn: {hours} ঘন্টা আগে
ko: {hours}시간 전

# daysAgo
source: {days}d ago
bn: {days} দিন আগে
ko: {days}일 전

# daysAgoCount
source: {count}d ago
bn: {count} দিন আগে
ko: {count}일 전

# hoursAgoCount
source: {count}h ago
bn: {count} ঘন্টা আগে
ko: {count}시간 전

# minutesAgoCount
source: {count}m ago
bn: {count} মিনিট আগে
ko: {count}분 전

source: Yesterday
bn: গতকাল
ko: 어제

source: Today
bn: আজ
ko: 오늘

source: Call started
bn: কল শুরু হয়েছে
ko: 통화 시작됨

source: Video Call
bn: ভিডিও কল
ko: 영상 통화

source: Audio Call
bn: অডিও কল
ko: 음성 통화

source: End Call
bn: কল শেষ করুন
ko: 통화 종료

source: Answer Call
bn: কল উত্তর দিন
ko: 통화 받기

source: Decline Call
bn: কল প্রত্যাখ্যান করুন
ko: 통화 거절

source: Calling...
bn: কল করা হচ্ছে...
ko: 통화 중...

source: Connecting...
bn: সংযোগ করা হচ্ছে...
ko: 연결 중...

source: Connected
bn: সংযুক্ত
ko: 연결됨

source: Disconnected
bn: সংযোগ বিচ্ছিন্ন
ko: 연결 해제됨

source: Retry
bn: পুনরায় চেষ্টা
ko: 다시 시도

source: Block
bn: ব্লক করুন
ko: 차단

source: Unblock
bn: আনব্লক করুন
ko: 차단 해제

source: Report
bn: রিপোর্ট করুন
ko: 신고

source: Report User
bn: ব্যবহারকারীকে রিপোর্ট করুন
ko: 사용자 신고

source: Block User
bn: ব্যবহারকারীকে ব্লক করুন
ko: 사용자 차단

source: Age
bn: বয়স
ko: 나이

source: Interests
bn: আগ্রহ
ko: 관심사

# nativeLanguageLabel
source: Native Language
bn: মাতৃভাষা
ko: 모국어

# learningLanguageLabel
source: Learning Language
bn: শেখার ভাষা
ko: 학습 언어

source: Wave
bn: হাত নাড়ানো
ko: 손 흔들기

source: Waved
bn: হাত নেড়েছেন
ko: 손을 흔들었습니다

source: waved at
bn: কে হাত নেড়েছেন
ko: 에게 손을 흔들었습니다

source: React
bn: রিয়্যাক্ট করুন
ko: 반응

source: Reply
bn: উত্তর
ko: 답글

source: Forward
bn: ফরওয়ার্ড করুন
ko: 전달

source: Message Info
bn: বার্তার তথ্য
ko: 메시지 정보

source: Delivered
bn: পৌঁছেছে
ko: 전달됨

source: Read
bn: পড়া হয়েছে
ko: 읽음

source: Sent
bn: পাঠানো হয়েছে
ko: 전송됨

source: Failed
bn: ব্যর্থ
ko: 실패

source: Sending
bn: পাঠানো হচ্ছে
ko: 전송 중

source: Select Contact
bn: যোগাযোগ নির্বাচন করুন
ko: 연락처 선택

source: New Message
bn: নতুন বার্তা
ko: 새 메시지

source: New Group
bn: নতুন গ্রুপ
ko: 새 그룹

source: Create Group
bn: গ্রুপ তৈরি করুন
ko: 그룹 생성

source: Group Name
bn: গ্রুপের নাম
ko: 그룹 이름

source: Add Members
bn: সদস্য যোগ করুন
ko: 멤버 추가

source: Members
bn: সদস্যরা
ko: 멤버

source: Admin
bn: প্রশাসক
ko: 관리자

source: Moderator
bn: মডারেটর
ko: 중재자

source: Member
bn: সদস্য
ko: 멤버

source: Leave Group
bn: গ্রুপ ছেড়ে দিন
ko: 그룹 나가기

source: Delete Group
bn: গ্রুপ মুছে দিন
ko: 그룹 삭제

source: Group Info
bn: গ্রুপের তথ্য
ko: 그룹 정보

source: Edit Group
bn: গ্রুপ সম্পাদনা করুন
ko: 그룹 편집

source: Add Member
bn: সদস্য যোগ করুন
ko: 멤버 추가

source: Remove Member
bn: সদস্য সরান
ko: 멤버 제거

source: Make Admin
bn: প্রশাসক করুন
ko: 관리자로 지정

source: Remove Admin
bn: প্রশাসক সরান
ko: 관리자 해제

source: You left
bn: আপনি চলে গেছেন
ko: 나갔습니다

source: You joined
bn: আপনি যোগ দিয়েছেন
ko: 참여했습니다

source: Joined
bn: যোগ দিয়েছেন
ko: 참여했습니다

source: left
bn: চলে গেছেন
ko: 나갔습니다

source: was removed
bn: সরানো হয়েছে
ko: 제거되었습니다

source: was added
bn: যোগ করা হয়েছে
ko: 추가되었습니다

source: became admin
bn: প্রশাসক হয়েছেন
ko: 관리자가 되었습니다

# noLongerAdmin
source: is no longer admin
bn: আর প্রশাসক নেই
ko: 더 이상 관리자가 아닙니다

source: Add Course
bn: কোর্স যোগ করুন
ko: 코스 추가

source: See People's Chats
bn: লোকেদের চ্যাট দেখুন
ko: 사람들의 채팅 보기

source: All Courses
bn: সব কোর্স
ko: 모든 코스

# searchCourses
source: Search for courses...
bn: কোর্স খুঁজুন...
ko: 강좌 검색...

source: Search People
bn: লোকজন খুঁজুন
ko: 사람 검색

# newLabel
source: New
bn: নতুন
ko: 새로운

source: Translate
bn: অনুবাদ
ko: 번역

source: Search
bn: খুঁজুন
ko: 검색

source: Popular
bn: জনপ্রিয়
ko: 인기

source: Done
bn: সম্পন্ন
ko: 완료

source: Swap Languages
bn: ভাষা অদলবদল
ko: 언어 교환

source: Enter text to translate
bn: অনুবাদ করার জন্য পাঠ্য লিখুন
ko: 번역할 텍스트를 입력하세요

source: Play
bn: খেলা
ko: 플레이

source: Japanese AI
bn: জাপানি এআই
ko: 일본어 AI

source: More
bn: আরও
ko: 더보기

source: Recent
bn: সাম্প্রতিক
ko: 최근

source: For You
bn: আপনার জন্য
ko: 추천

source: Likes
bn: পছন্দ
ko: 좋아요

source: Comments
bn: মন্তব্য
ko: 댓글

# viewAllComments
source: View all {count} comments
bn: সব {count}টি মন্তব্য দেখুন
ko: 모든 {count}개 댓글 보기

# seeMore
source: more
bn: আরো
ko: 더보기

# seeLess
source: less
bn: কম
ko: 줄이기

source: Translated
bn: অনূদিত
ko: 번역됨

source: Following
bn: অনুসরণ করছি
ko: 팔로잉

source: Follow
bn: অনুসরণ করুন
ko: 팔로우

source: Details
bn: বিস্তারিত
ko: 상세

source: Liked by
bn: পছন্দ করেছেন
ko: 좋아요 한 사람

# addComment
source: Add a comment...
bn: মন্তব্য যোগ করুন...
ko: 댓글 추가...

source: Find Partners
bn: সঙ্গী খুঁজুন
ko: 파트너 찾기

source: All
bn: সব
ko: 전체

source: Serious Learners
bn: গুরুতর শিক্ষার্থী
ko: 진지한 학습자

source: Nearby
bn: কাছাকাছি
ko: 근처

source: Language Level
bn: ভাষার স্তর
ko: 언어 수준

source: Elementary
bn: প্রাথমিক
ko: 기초

source: Proficient
bn: দক্ষ
ko: 숙련

source: New Users
bn: নতুন ব্যবহারকারী
ko: 신규 사용자

source: Advanced Search
bn: উন্নত অনুসন্ধান
ko: 고급 검색

source: Region of language partner
bn: ভাষা সঙ্গীর অঞ্চল
ko: 언어 파트너의 지역

source: City of language partner
bn: ভাষা সঙ্গীর শহর
ko: 언어 파트너의 도시

source: Reset
bn: রিসেট
ko: 재설정

# commentsWithCount
source: Comments ({count})
bn: মন্তব্য ({count})
ko: 댓글 ({count})

# likesWithCount
source: {count} Likes >
bn: {count} পছন্দ >
ko: {count} 좋아요 >

source: No likes yet
bn: এখনো কোনো পছন্দ নেই
ko: 아직 좋아요가 없습니다

source: now
bn: এখনই
ko: 방금

source: You
bn: আপনি
ko: 당신

source: Language Learn
bn: ভাষা শিক্ষা
ko: 언어 학습

source: Enrolled
bn: ভর্তি
ko: 등록됨

source: Other Courses
bn: অন্যান্য কোর্স
ko: 다른 강좌

source: students
bn: শিক্ষার্থী
ko: 학생

source: Completed
bn: সম্পন্ন
ko: 완료

source: In Progress
bn: চলমান
ko: 진행 중

source: Course Completed
bn: কোর্স সম্পূর্ণ
ko: 강좌가 성공적으로 완료되었습니다!

source: View All
bn: সব দেখুন
ko: 모두 보기

source: Courses
bn: কোর্স
ko: 강좌

source: Instructor
bn: প্রশিক্ষক
ko: 강사

source: Course Description
bn: কোর্সের বিবরণ
ko: 강의 설명

source: Duration
bn: সময়কাল
ko: 기간

source: Start Date
bn: শুরুর তারিখ
ko: 시작 날짜

source: End Date
bn: শেষ তারিখ
ko: 종료 날짜

source: Price
bn: মূল্য
ko: 가격

source: Enroll for
bn: ভর্তি হন
ko: 등록하기

source: Enrolled successfully!
bn: সফলভাবে ভর্তি হয়েছেন!
ko: 성공적으로 등록되었습니다!

source: Course Details
bn: কোর্সের বিবরণ
ko: 강의 상세정보

source: Online Sessions
bn: অনলাইন সেশন
ko: 온라인 세션

source: Recorded Classes
bn: রেকর্ড করা ক্লাস
ko: 녹화 수업

# accessAllRecordedSessions
source: Access all recorded sessions anytime
bn: যেকোনো সময় সকল রেকর্ড করা সেশন অ্যাক্সেস করুন
ko: 언제든지 모든 녹화된 세션에 접근하세요

source: Video Library
bn: ভিডিও লাইব্রেরি
ko: 비디오 라이브러리

source: Total Videos
bn: মোট ভিডিও
ko: 총 비디오

source: Total Duration
bn: মোট সময়কাল
ko: 총 재생 시간

source: Total Size
bn: মোট আকার
ko: 총 크기

source: Loading video metadata...
bn: ভিডিও মেটাডেটা লোড করা হচ্ছে...
ko: 동영상 메타데이터 로딩 중...

# completeProgress
source: {percent}% Complete
bn: {percent}% সম্পূর্ণ
ko: {percent}% 완료

source: Failed to load video metadata
bn: ভিডিও মেটাডেটা লোড করতে ব্যর্থ
ko: 동영상 메타데이터 로드 실패

source: No videos available
bn: কোন ভিডিও উপলব্ধ নেই
ko: 사용 가능한 비디오 없음

# checkBackLaterForRecorded
source: Check back later for recorded classes
bn: রেকর্ড করা ক্লাসের জন্য পরে আবার দেখুন
ko: 녹화 수업은 나중에 다시 확인하세요

# failedVideosCount
source: {failed} of {total} videos failed to load metadata
bn: {total}টির মধ্যে {failed}টি ভিডিওর মেটাডেটা লোড করতে ব্যর্থ
ko: {total}개 중 {failed}개 비디오의 메타데이터 로딩 실패

source: Failed to load
bn: লোড করতে ব্যর্থ
ko: 로딩 실패

source: No description available
bn: কোন বর্ণনা উপলব্ধ নেই
ko: 설명이 없습니다

# videoError
source: Error: {error}
bn: ত্রুটি: {error}
ko: 오류: {error}

# unknownUploadDate
source: Unknown
bn: অজানা
ko: 알 수 없음

source: Watch Now
bn: এখনই দেখুন
ko: 지금 시청

source: ✅ Video metadata loaded successfully
bn: ✅ ভিডিও মেটাডেটা সফলভাবে লোড হয়েছে
ko: ✅ 비디오 메타데이터가 성공적으로 로딩됨

# failedToLoadVideoMetadataSnackbar
source: ❌ Failed to load video metadata
bn: ❌ ভিডিও মেটাডেটা লোড করতে ব্যর্থ
ko: ❌ 비디오 메타데이터 로딩 실패

# errorMessage
source: ❌ Error: {error}
bn: ❌ ত্রুটি: {error}
ko: ❌ 오류: {error}

source: ❌ Cannot play video: {error}
bn: ❌ ভিডিও চালাতে পারছে না: {error}
ko: ❌ 비디오를 재생할 수 없습니다: {error}

source: Loading Video Player...
bn: ভিডিও প্লেয়ার লোড করা হচ্ছে...
ko: 동영상 플레이어 로딩 중...

# videoDurationSize
source: Duration: {duration} • Size: {size}
bn: সময়কাল: {duration} • আকার: {size}
ko: 재생 시간: {duration} • 크기: {size}

source: 📹 Video Information:
bn: ভিডিও তথ্য
ko: 동영상 정보

source: Video Title
bn: ভিডিও শিরোনাম
ko: 동영상 제목

# videoDurationInfo
source: • Duration: {duration}
bn: • সময়কাল: {duration}
ko: • 재생 시간: {duration}

# videoStatusInfo
source: • Status: {status}
bn: • অবস্থা: {status}
ko: • 상태: {status}

# videoResolutionInfo
source: • Resolution: {width}x{height}
bn: • রেজোলিউশন: {width}x{height}
ko: • 해상도: {width}x{height}

# videoStatusLoaded
source: Loaded
bn: লোড হয়েছে
ko: 로딩 완료

# videoStatusLoading
source: Loading...
bn: লোড হচ্ছে...
ko: 로딩 중...

source: Video Info
bn: ভিডিও তথ্য
ko: 동영상 정보

source: Loading video...
bn: ভিডিও লোড হচ্ছে...
ko: 동영상 로딩 중...

source: Failed to load video
bn: ভিডিও লোড করতে ব্যর্থ
ko: 동영상 로드 실패

source: Preparing video...
bn: ভিডিও প্রস্তুত করা হচ্ছে...
ko: 비디오 준비 중...

# connectionTimeoutMessage
source: Connection timeout. Please check your internet and try again.
bn: সংযোগ সময় শেষ। আপনার ইন্টারনেট চেক করুন এবং আবার চেষ্টা করুন।
ko: 연결 시간 초과. 인터넷 연결을 확인하고 다시 시도하세요.

# videoNotFoundMessage
source: Video not found. The video URL may be invalid.
bn: ভিডিও পাওয়া যায়নি। ভিডিও URL অবৈধ হতে পারে।
ko: 비디오를 찾을 수 없습니다. 비디오 URL이 유효하지 않을 수 있습니다.

# networkErrorMessage
source: Network error. Please check your internet connection.
bn: নেটওয়ার্ক ত্রুটি। আপনার ইন্টারনেট সংযোগ চেক করুন।
ko: 네트워크 오류. 인터넷 연결을 확인하세요.

# videoLoadingTimeoutMessage
source: Video loading timeout - Check your internet connection
bn: ভিডিও লোডিং টাইমআউট - আপনার ইন্টারনেট সংযোগ চেক করুন
ko: 비디오 로딩 시간 초과 - 인터넷 연결을 확인하세요

# videoErrorGeneric
source: Video Error: {error}
bn: ভিডিও ত্রুটি: {error}
ko: 비디오 오류: {error}

source: Unknown error
bn: অজানা ত্রুটি
ko: 알 수 없는 오류

source: Study Materials
bn: অধ্যয়ন উপকরণ
ko: 학습 자료

# downloadAndAccessMaterials
source: Download and access course materials
bn: কোর্স উপকরণ ডাউনলোড এবং অ্যাক্সেস করুন
ko: 강좌 자료를 다운로드하고 접근하세요

source: Total
bn: মোট
ko: 총

source: PDFs
bn: PDF
ko: PDF

source: Images
bn: ছবি
ko: 이미지

source: View
bn: দেখুন
ko: 보기

source: Download
bn: ডাউনলোড
ko: 다운로드

source: Show More
bn: আরো দেখান
ko: 더 보기

source: Show Less
bn: কম দেখান
ko: 적게 보기

source: Untitled Material
bn: শিরোনামহীন উপকরণ
ko: 제목 없는 자료

# noUrlAvailable
source: ❌ No URL available for this material
bn: ❌ এই উপকরণের জন্য কোন URL উপলব্ধ নেই
ko: ❌ 이 자료의 URL을 사용할 수 없습니다

# openingFileType
source: Opening {type}...
bn: {type} খোলা হচ্ছে...
ko: {type} 열기 중...

# noUrlForDownload
source: ❌ No URL available for download
bn: ❌ ডাউনলোডের জন্য কোন URL উপলব্ধ নেই
ko: ❌ 다운로드할 URL을 사용할 수 없습니다

source: Download File
bn: ফাইল ডাউনলোড
ko: 파일 다운로드

# downloadConfirmation
source: This will open the file in your browser for download.
bn: এটি ডাউনলোডের জন্য আপনার ব্রাউজারে ফাইল খুলবে।
ko: 브라우저에서 파일을 열어 다운로드합니다.

# fileTypeLabel
source: Type: {type}
bn: প্রকার: {type}
ko: 유형: {type}

# browserHandleDownload
source: Your browser will handle the download to your default downloads folder.
bn: আপনার ব্রাউজার আপনার ডিফল্ট ডাউনলোড ফোল্ডারে ডাউনলোড পরিচালনা করবে।
ko: 브라우저가 기본 다운로드 폴더로 다운로드를 처리합니다.

source: Open in Browser
bn: ব্রাউজারে খুলুন
ko: 브라우저에서 열기

# couldNotOpenBrowser
source: Could not open browser. Link copied to clipboard.
bn: ব্রাউজার খুলতে পারেনি। লিংক ক্লিপবোর্ডে কপি করা হয়েছে।
ko: 브라우저를 열 수 없습니다. 링크가 클립보드에 복사되었습니다.

source: ❌ Failed to open browser
bn: ❌ ব্রাউজার খুলতে ব্যর্থ
ko: ❌ 브라우저 열기 실패

# linkCopiedInstead
source: Link copied to clipboard instead.
bn: বরং লিংক ক্লিপবোর্ডে কপি করা হয়েছে।
ko: 대신 링크가 클립보드에 복사되었습니다.

# downloadLinkCopied
source: 📎 Download link copied to clipboard
bn: 📎 ডাউনলোড লিংক ক্লিপবোর্ডে কপি করা হয়েছে
ko: 📎 다운로드 링크가 클립보드에 복사됨

# pasteAndGo
source: Paste & Go
bn: পেস্ট করুন এবং যান
ko: 붙여넣고 이동

source: Download Instructions
bn: ডাউনলোড নির্দেশাবলী
ko: 다운로드 지침

# linkCopiedToClipboard
source: {item} copied to clipboard
bn: {item} ক্লিপবোর্ডে কপি করা হয়েছে
ko: {item}이(가) 클립보드에 복사되었습니다

source: To download:
bn: ডাউনলোড করতে:
ko: 다운로드 방법:

# openYourBrowser
source: 1. Open your browser
bn: ১. আপনার ব্রাউজার খুলুন
ko: 1. 브라우저 열기

# pasteLinkInAddress
source: 2. Paste the link in the address bar
bn: ২. ঠিকানা বারে লিংক পেস্ট করুন
ko: 2. 주소창에 링크 붙여넣기

# pressEnterToDownload
source: 3. Press Enter to start download
bn: ৩. ডাউনলোড শুরু করতে Enter চাপুন
ko: 3. Enter를 눌러 다운로드 시작

source: Got it
bn: বুঝেছি
ko: 알겠습니다

# failedToCopyLink
source: Failed to copy link: {error}
bn: লিংক কপি করতে ব্যর্থ: {error}
ko: 링크 복사 실패: {error}

# loadingFileTypeViewer
source: Loading {type}...
bn: {type} লোড হচ্ছে...
ko: {type} 로딩 중...

source: Failed to load document
bn: ডকুমেন্ট লোড করতে ব্যর্থ
ko: 문서 로딩 실패

# pdfLoadedPages
source: PDF loaded: {pages} pages
bn: PDF লোড হয়েছে: {pages} পাতা
ko: PDF 로딩 완료: {pages}페이지

source: Loading image...
bn: ছবি লোড হচ্ছে...
ko: 이미지 로딩 중...

source: Failed to load image
bn: ছবি লোড করতে ব্যর্থ
ko: 이미지 로딩 실패

# checkImageUrl
source: Please check the image URL
bn: অনুগ্রহ করে ছবির URL চেক করুন
ko: 이미지 URL을 확인하세요

# documentOpenInBrowser
source: This document will open in your default browser or Google Docs app
bn: এই নথি আপনার ডিফল্ট ব্রাউজার বা Google Docs অ্যাপে খুলবে
ko: 이 문서는 기본 브라우저나 Google Docs 앱에서 열립니다

source: Open Document
bn: নথি খুলুন
ko: 문서 열기

source: Go Back
bn: পিছনে যান
ko: 뒤로 가기

source: Unsupported file type
bn: অসমর্থিত ফাইল প্রকার
ko: 지원되지 않는 파일 유형

# failedToOpenUrl
source: Failed to open URL: {error}
bn: URL খুলতে ব্যর্থ: {error}
ko: URL 열기 실패: {error}

source: Opening document in browser...
bn: ব্রাউজারে নথি খোলা হচ্ছে...
ko: 브라우저에서 문서 열기 중...

# errorOpeningBrowser
source: Error opening browser. Link copied to clipboard.
bn: ব্রাউজার খোলায় ত্রুটি। লিংক ক্লিপবোর্ডে কপি করা হয়েছে।
ko: 브라우저를 여는 중 오류가 발생했습니다. 링크가 클립보드에 복사되었습니다.

# linkCopiedToClipboardViewer
source: {label} copied to clipboard
bn: {label} ক্লিপবোর্ডে কপি করা হয়েছে
ko: {label}이(가) 클립보드에 복사됨

source: Failed to copy {label}
bn: {label} কপি করতে ব্যর্থ
ko: {label} 복사 실패

source: Document link
bn: ডকুমেন্ট লিংক
ko: 문서 링크

source: Group Chat
bn: গ্রুপ চ্যাট
ko: 그룹 채팅

source: Progress
bn: অগ্রগতি
ko: 진도

source: Your Learning Journey
bn: আপনার শেখার যাত্রা
ko: 당신의 학습 여정

source: Learning Portal
bn: শিক্ষা পোর্টাল
ko: 학습 포털

source: Course Discussion
bn: কোর্স আলোচনা
ko: 코스 토론

source: online
bn: অনলাইন
ko: 온라인

source: participants
bn: অংশগ্রহণকারী
ko: 참가자

source: Type your message...
bn: আপনার বার্তা টাইপ করুন...
ko: 메시지를 입력하세요...

# completedLowercase
source: completed
bn: সম্পন্ন
ko: 완료됨

source: All Enrolled Courses
bn: সব ভর্তিকৃত কোর্স
ko: 모든 등록된 강좌

source: All Other Courses
bn: সব অন্যান্য কোর্স
ko: 모든 기타 강좌

source: No courses found
bn: কোনো কোর্স পাওয়া যায়নি
ko: 강의를 찾을 수 없습니다

source: Live Sessions
bn: লাইভ সেশন
ko: 라이브 세션

# joinInteractiveSessions
source: Join interactive sessions with your instructor
bn: আপনার প্রশিক্ষকের সাথে ইন্টারঅ্যাক্টিভ সেশনে যোগ দিন
ko: 강사와 함께하는 대화형 세션에 참여하세요

source: Total Sessions
bn: মোট সেশন
ko: 총 세션 수

source: Attended
bn: উপস্থিত
ko: 참석함

source: Scheduled Sessions
bn: নির্ধারিত সেশন
ko: 예정된 세션

source: Topics Covered:
bn: আলোচিত বিষয়:
ko: 다룬 주제:

source: Reminder set for
bn: অনুস্মারক সেট করা হয়েছে
ko: 알림이 설정되었습니다

source: Joining
bn: যোগদান করছে
ko: 참여 중

source: Loading recording for
bn: রেকর্ডিং লোড করছে
ko: 녹화 영상 로딩 중

source: Join Session
bn: সেশনে যোগ দিন
ko: 세션 참여

source: Set Reminder
bn: অনুস্মারক সেট করুন
ko: 알림 설정

source: View Recording
bn: রেকর্ডিং দেখুন
ko: 녹화 보기

source: Session Cancelled
bn: সেশন বাতিল
ko: 세션 취소됨

source: View Details
bn: বিস্তারিত দেখুন
ko: 상세 보기

source: Learning Progress
bn: শেখার অগ্রগতি
ko: 학습 진행상황

# trackYourLearningJourney
source: Track your learning journey and achievements
bn: আপনার শেখার যাত্রা এবং অর্জন ট্র্যাক করুন
ko: 학습 여정과 성취를 추적하세요

source: Overall Progress
bn: সার্বিক অগ্রগতি
ko: 전체 진행률

source: Course Modules
bn: কোর্স মডিউল
ko: 강좌 모듈

source: Complete
bn: সম্পূর্ণ
ko: 완료

# newText
source: New
bn: নতুন
ko: 새로운

source: Playing
bn: চালানো হচ্ছে
ko: 재생 중

source: Downloading
bn: ডাউনলোড করছে
ko: 다운로드 중

source: Total Materials
bn: মোট উপকরণ
ko: 총 자료

source: Downloaded
bn: ডাউনলোড করা হয়েছে
ko: 다운로드됨

source: Opening
bn: খোলা হচ্ছে
ko: 열고 있습니다

source: Watched
bn: দেখা হয়েছে
ko: 시청 완료

source: Spanish
bn: স্প্যানিশ
ko: 스페인어

source: About Me
bn: আমার সম্পর্কে
ko: 자기소개

source: Self-introduction
bn: আত্মপরিচয়
ko: 자기소개

source: Tell us about yourself...
bn: আপনার সম্পর্কে বলুন...
ko: 자신에 대해 알려주세요

source: Edit Bio
bn: পরিচয় সম্পাদনা
ko: 자기소개 편집

source: Edit Image
bn: ছবি সম্পাদনা
ko: 이미지 편집

source: Camera
bn: ক্যামেরা
ko: 카메라

source: Gallery
bn: গ্যালারি
ko: 갤러리

source: Take Photo
bn: ছবি তুলুন
ko: 사진 촬영

source: Select from Gallery
bn: গ্যালারি থেকে নির্বাচন করুন
ko: 갤러리에서 선택

source: Native
bn: মাতৃভাষা
ko: 모국어

source: Learning
bn: শিখছি
ko: 학습 중

source: Add Hobbies
bn: শখ যোগ করুন
ko: 취미 추가

source: Select Hobbies
bn: শখ নির্বাচন করুন
ko: 취미 선택

source: Personal Information
bn: ব্যক্তিগত তথ্য
ko: 개인정보

source: Select Gender
bn: লিঙ্গ নির্বাচন করুন
ko: 성별 선택

source: Select Age
bn: বয়স নির্বাচন করুন
ko: 나이 선택

source: Birthday
bn: জন্মদিন
ko: 생일

source: Birthday updated successfully!
bn: জন্মদিন সফলভাবে আপডেট হয়েছে!
ko: 생일이 성공적으로 업데이트되었습니다

source: Theme
bn: থিম
ko: 테마

source: Theme Mode
bn: থিম মোড
ko: 테마 모드

source: Dark Mode
bn: ডার্ক মোড
ko: 다크 모드

source: Light Mode
bn: লাইট মোড
ko: 라이트 모드

source: Movie
bn: সিনেমা
ko: 영화

source: Anime
bn: অ্যানিমে
ko: 애니메이션

source: Cosplay
bn: কসপ্লে
ko: 코스프레

source: Reading
bn: পড়া
ko: 독서

source: Sports
bn: খেলাধুলা
ko: 스포츠

source: Dancing
bn: নাচ
ko: 댄스

source: Chat Options
bn: চ্যাট অপশন
ko: 채팅 옵션

# videoCallFeature
source: Video call feature coming soon!
bn: ভিডিও কল ফিচার শীঘ্রই আসছে!
ko: 영상통화 기능이 곧 출시됩니다!

source: Message translated!
bn: বার্তা অনুবাদ হয়েছে!
ko: 메시지가 번역되었습니다!

# originalMessage
source: Original:
bn: মূল:
ko: 원본:

# correctionMessage
source: Correction:
bn: সংশোধন:
ko: 수정:

source: Correct Message
bn: বার্তা সংশোধন করুন
ko: 메시지 수정

source: Send Attachment
bn: সংযুক্তি পাঠান
ko: 첨부파일 보내기

source: Photo
bn: ছবি
ko: 사진

source: Voice
bn: কণ্ঠস্বর
ko: 음성

source: Document
bn: নথি
ko: 문서
