Repository: shoyeb017/SayHello_App_Fullstack_
Catalog: frontend_sayhello_app/lib/l10n/app_*.arb
Languages: bn, ko

source: Location
bn: অবস্থান
ko: 위치

source: Followers
bn: অনুসরণকারী
ko: 팔로워

source: Shared Interests
bn: সাধারণ আগ্রহ
ko: 공통 관심사

# interestsAndHobbies
source: Interests & Hobbies
bn: আগ্রহ ও শখ
ko: 관심사 및 취미

# messageButton
source: Message
bn: বার্তা
ko: 메시지

# callButton
source: Call
bn: কল
ko: 통화

source: Camera feature coming soon!
bn: ক্যামেরা ফিচার শীঘ্রই আসছে!
ko: 카메라 기능이 곧 출시됩니다!

source: Gallery feature coming soon!
bn: গ্যালারি ফিচার শীঘ্রই আসছে!
ko: 갤러리 기능이 곧 출시됩니다!

source: Bio updated successfully!
bn: জীবনী সফলভাবে আপডেট হয়েছে!
ko: 프로필이 성공적으로 업데이트되었습니다!

source: Hobbies updated successfully!
bn: শখ সফলভাবে আপডেট হয়েছে!
ko: 취미가 성공적으로 업데이트되었습니다!

source: Color Mode
bn: কালার মোড
ko: 컬러 모드

source: Change app language
bn: অ্যাপের ভাষা পরিবর্তন করুন
ko: 앱 언어 변경

source: Choose your preferred language
bn: আপনার পছন্দের ভাষা বেছে নিন
ko: 원하는 언어를 선택하세요

# genderUpdated
source: Gender updated to {gender}
bn: লিঙ্গ {gender} এ আপডেট করা হয়েছে
ko: 성별이 {gender}(으)로 업데이트되었습니다

# ageUpdated
source: Age updated to {age}
bn: বয়স {age} এ আপডেট করা হয়েছে
ko: 나이가 {age}로 업데이트되었습니다

# fieldUpdated
source: {field} updated successfully!
bn: {field} সফলভাবে আপডেট হয়েছে!
ko: {field}이(가) 성공적으로 업데이트되었습니다!

source: Enter correction...
bn: সংশোধন লিখুন...
ko: 수정 사항을 입력하세요...

source: Just joined HT
bn: এইমাত্র HT তে যোগদান করেছে

source: Tap to say Hi!
bn: হাই বলতে ট্যাপ করুন!

# joinedShort
source: joined
bn: যোগদান
ko: 가입

# daysJoined
source: {days}d joined
bn: {days}দিন যোগদান

# areYouSureLogout
source: Are you sure you want to logout?
bn: আপনি কি নিশ্চিত যে লগআউট করতে চান?
ko: 정말로 로그아웃하시겠습니까?

source: Edit Name
bn: নাম সম্পাদনা
ko: 이름 편집

source: Enter your name
bn: আপনার নাম লিখুন
ko: 이름을 입력하세요

source: Select Country
bn: দেশ নির্বাচন করুন
ko: 국가 선택

source: Select Learning Language & Level
bn: শেখার ভাষা ও স্তর নির্বাচন করুন
ko: 학습 언어 및 레벨 선택

source: Level
bn: স্তর
ko: 수준

source: Detect
bn: শনাক্ত
ko: 감지

source: Translating...
bn: অনুবাদ করা হচ্ছে...
ko: 번역 중...

source: Translation
bn: অনুবাদ
ko: 번역

source: Copy translation
bn: অনুবাদ কপি করুন
ko: 번역 복사

source: Pronunciation
bn: উচ্চারণ
ko: 발음

source: Copy pronunciation
bn: উচ্চারণ কপি করুন
ko: 발음 복사

# pronunciationNotAvailable
source: Pronunciation guide not available for this language
bn: এই ভাষার জন্য উচ্চারণ গাইড উপলব্ধ নেই

# demoModeMessage
source: Demo mode: Using fallback translations. Configure Azure credentials in the service code for full functionality.
bn: ডেমো মোড: ফলব্যাক অনুবাদ ব্যবহার করা হচ্ছে। সম্পূর্ণ কার্যকারিতার জন্য সার্ভিস কোডে Azure credentials কনফিগার করুন।

source: Detected language
bn: সনাক্তকৃত ভাষা
ko: 감지된 언어

source: Could not detect language
bn: ভাষা সনাক্ত করা যায়নি

# copiedToClipboard
source: {label} copied to clipboard
bn: {label} ক্লিপবোর্ডে কপি করা হয়েছে
ko: {label}이(가) 클립보드에 복사되었습니다

source: Failed to play speech
bn: স্পিচ প্লে করতে ব্যর্থ
ko: 음성 재생 실패

source: Speech error
bn: স্পিচ ত্রুটি
ko: 음성 오류

source: Speaking...
bn: বলছে...
ko: 말하는 중...

source: Stop speech
bn: স্পিচ বন্ধ করুন
ko: 음성 중지

source: Listen to text
bn: পাঠ্য শুনুন
ko: 텍스트 듣기

source: Listen to translation
bn: অনুবাদ শুনুন
ko: 번역 듣기

source: Translation failed
bn: অনুবাদ ব্যর্থ
ko: 번역 실패

# failedToDetectLanguage
source: Could not detect language
bn: ভাষা সনাক্ত করা যায়নি
ko: 언어를 감지할 수 없습니다

# pronunciationGuideNotAvailable
source: Pronunciation guide not available for this language
bn: এই ভাষার জন্য উচ্চারণ গাইড উপলব্ধ নেই
ko: 이 언어에 대한 발음 가이드를 사용할 수 없습니다

source: Azure credentials not configured
bn: Azure শংসাপত্র কনফিগার করা হয়নি
ko: Azure 자격 증명이 구성되지 않았습니다

source: Unknown
bn: অজানা
ko: 알 수 없음

source: Notifications
bn: বিজ্ঞপ্তি
ko: 알림

source: New Session Available
bn: নতুন সেশন উপলব্ধ
ko: 새 세션 이용 가능

# sessionScheduled
source: {courseName} session has been scheduled by {instructorName} on {date} at {time}. Join now to enhance your learning!
bn: {instructorName} দ্বারা {date} তারিখে {time} এ {courseName} সেশন নির্ধারিত হয়েছে। আপনার শেখার উন্নতির জন্য এখনই যোগ দিন!
ko: {instructorName}에 의해 {date} {time}에 {courseName} 세션이 예약되었습니다. 지금 참여하여 학습을 향상시키세요!

source: Course Feedback Received
bn: কোর্স ফিডব্যাক গ্রহণ
ko: 코스 피드백 수신

# feedbackReceived
source: You received a {rating} star rating for your {courseName} course from instructor {instructorName}. Keep up the excellent work!
bn: আপনি প্রশিক্ষক {instructorName} থেকে আপনার {courseName} কোর্সের জন্য {rating} তারকা রেটিং পেয়েছেন। চমৎকার কাজ চালিয়ে যান!
ko: 강사 {instructorName}로부터 {courseName} 코스에 대해 {rating}점 평가를 받았습니다. 계속해서 훌륭한 작업을 이어가세요!

# weeksAgo
source: {weeks}w ago
bn: {weeks} সপ্তাহ আগে
ko: {weeks}주 전

# youHaveNewNotifications
source: You have {count} new notification{plural}
bn: আপনার {count}টি নতুন বিজ্ঞপ্তি আছে
ko: {count}개의 새 알림이 있습니다

source: No notifications yet
bn: এখনো কোন বিজ্ঞপ্তি নেই
ko: 아직 알림이 없습니다

# allCaughtUp
source: You're all caught up! 🎉
bn: সব দেখা হয়ে গেছে! 🎉
ko: 모든 알림을 확인했습니다! 🎉

source: Search your course here...
bn: এখানে আপনার কোর্স খুঁজুন...
ko: 여기서 코스를 검색하세요...

source: My Courses
bn: আমার কোর্সগুলি
ko: 내 강의

source: Level Category
bn: লেভেল ক্যাটাগরি
ko: 레벨 카테고리

source: Popular Courses
bn: জনপ্রিয় কোর্স
ko: 인기 코스

source: Expired Courses
bn: মেয়াদোত্তীর্ণ কোর্স
ko: 만료된 코스

source: Sessions
bn: সেশন
ko: 세션

# sessionsCount
source: {count} Sessions
bn: {count}টি সেশন
ko: {count}개 세션

source: by
bn: দ্বারা
ko: 작성자:

source: by {instructor}
bn: {instructor} দ্বারা
ko: {instructor}에 의해

# completedPercentage
source: {percentage}% completed
bn: {percentage}% সম্পন্ন
ko: {percentage}% 완료

# coursesCompleted
source: Completed
bn: সম্পন্ন
ko: 완료

source: Expired
bn: মেয়াদ শেষ
ko: 만료

source: No enrolled courses
bn: কোন ভর্তি কোর্স নেই
ko: 등록된 코스가 없습니다

# searchCoursesByName
source: Search by course name, instructor...
bn: কোর্সের নাম, প্রশিক্ষক দিয়ে খুঁজুন...
ko: 코스명, 강사명으로 검색...

source: Status
bn: অবস্থা
ko: 상태

source: Upcoming
bn: আসন্ন
ko: 예정

source: Active
bn: সক্রিয়
ko: 진행중

source: Show popular only
bn: শুধু জনপ্রিয় দেখান
ko: 인기 코스만 표시

# coursesFound
source: {count} course{plural} found
bn: {count}টি কোর্স{plural} পাওয়া গেছে
ko: {count}개의 코스{plural}가 발견되었습니다

# courseDefault
source: Course
bn: কোর্স
ko: 코스

source: Navigation Menu
bn: নেভিগেশন মেনু
ko: 내비게이션 메뉴

source: Close Course
bn: কোর্স বন্ধ করুন
ko: 강의 닫기

# totalStat
source: Total
bn: মোট
ko: 전체

# doneStat
source: Done
bn: সম্পন্ন
ko: 완료

# nextStat
source: Next
bn: পরবর্তী
ko: 다음

source: Next Session
bn: পরবর্তী সেশন
ko: 다음 세션

source: Session Details
bn: সেশন বিবরণ
ko: 세션 세부정보

source: Session Link
bn: সেশন লিংক
ko: 세션 링크

source: Join Now
bn: এখনই যোগ দিন
ko: 지금 참가

source: Session Completed
bn: সেশন সম্পন্ন
ko: 세션 완료

source: Untitled Session
bn: শিরোনামহীন সেশন
ko: 제목 없는 세션

# durationLabel
source: Duration: {duration}
bn: সময়কাল: {duration}
ko: 기간: {duration}

# failedToCopy
source: Failed to copy {item}
bn: {item} কপি করতে ব্যর্থ হয়েছে
ko: {item} 복사에 실패했습니다

# openingSession
source: Opening {platform} session in browser...
bn: {platform} সেশন ব্রাউজারে খোলা হচ্ছে...
ko: {platform} 세션을 브라우저에서 열고 있습니다...

source: Course Title
bn: কোর্সের শিরোনাম
ko: 코스 제목

source: Meet Your Instructor
bn: আপনার প্রশিক্ষকের সাথে পরিচিত হন
ko: 강사 소개

source: About
bn: সম্পর্কে
ko: 소개

# coursesByInstructor
source: Courses
bn: কোর্স
ko: 코스

# studentsLabel
source: Students
bn: শিক্ষার্থী
ko: 수강생

# ratingLabel
source: Rating
bn: রেটিং
ko: 평점

# priceLabel
source: Price
bn: মূল্য
ko: 가격

# durationStat
source: Duration
bn: সময়কাল
ko: 기간

# levelLabel
source: Level
bn: স্তর
ko: 레벨

# languageLabel
source: Language
bn: ভাষা
ko: 언어

# statusLabel
source: Status
bn: অবস্থা
ko: 상태

# courseCompletedStatus
source: Course Completed
bn: কোর্স সম্পন্ন
ko: 코스 완료

source: Currently Enrolled
bn: বর্তমানে তালিকাভুক্ত
ko: 현재 수강 중

source: Enrollment Confirmed
bn: তালিকাভুক্তি নিশ্চিত
ko: 등록 확인됨

source: Enrollment Status
bn: তালিকাভুক্তির অবস্থা
ko: 등록 상태

# experienceYears
source: {years}+ years
bn: {years}+ বছর
ko: {years}년 이상

# expertIn
source: Expert in {language} Language
bn: {language} ভাষার বিশেষজ্ঞ
ko: {language} 언어 전문가

# studentCountText
source: {count} students
bn: {count} জন শিক্ষার্থী
ko: {count}명의 수강생

# instructorBioDefault
source: Experienced educator with over 8 years of teaching experience. Specializes in modern language learning techniques and interactive teaching methods.
bn: ৮ বছরেরও বেশি শিক্ষাদানের অভিজ্ঞতা সহ অভিজ্ঞ শিক্ষাবিদ। আধুনিক ভাষা শেখার কৌশল এবং ইন্টারঅ্যাক্টিভ শিক্ষাদান পদ্ধতিতে বিশেষজ্ঞ।
ko: 8년 이상의 교육 경험을 가진 경험 많은 교육자입니다. 현대적인 언어 학습 기법과 상호작용적인 교육 방법을 전문으로 합니다.

# instructorExperience
source: 8+ years
bn: ৮+ বছর
ko: 8년 이상

# instructorEducation
source: Expert in {language} Language
bn: {language} ভাষার বিশেষজ্ঞ
ko: {language} 언어 전문가

# aboutInstructor
source: About
bn: সম্পর্কে
ko: 소개

# instructorStudents
source: {count} students
bn: {count} জন শিক্ষার্থী
ko: {count}명의 학생

# instructorCourses
source: Courses
bn: কোর্স
ko: 강의

source: Instructor Rating
bn: প্রশিক্ষক রেটিং
ko: 강사 평점

# courseBy
source: by {instructor}
bn: {instructor} এর কোর্স
ko: {instructor} 강의

source: Expert in {language}
bn: {language} এর বিশেষজ্ঞ
ko: {language} 전문가

source: Course Feedback
bn: কোর্স ফিডব্যাক
ko: 코스 피드백

# reviewInstructorFeedback
source: Review instructor feedback and share your course experience
bn: প্রশিক্ষকের ফিডব্যাক পর্যালোচনা করুন এবং আপনার কোর্সের অভিজ্ঞতা শেয়ার করুন
ko: 강사 피드백을 검토하고 코스 경험을 공유하세요

source: Feedback from Instructor
bn: প্রশিক্ষকের কাছ থেকে ফিডব্যাক
ko: 강사로부터의 피드백

source: Give Your Feedback
bn: আপনার ফিডব্যাক দিন
ko: 피드백 제공하기

# rateCourse
source: Rate the Course
bn: কোর্স রেট করুন
ko: 코스 평가하기

# ratingValue
source: {rating}/5
bn: {rating}/৫

source: No rating
bn: কোন রেটিং নেই
ko: 평점 없음

source: Your Course Feedback
bn: আপনার কোর্স ফিডব্যাক
ko: 귀하의 코스 피드백

# courseFeedbackHint
source: Share your thoughts about the course content, structure, difficulty...
bn: কোর্সের বিষয়বস্তু, কাঠামো, কঠিনতা সম্পর্কে আপনার মতামত শেয়ার করুন...
ko: 코스 내용, 구조, 난이도에 대한 생각을 공유하세요...

source: Submit Course Feedback
bn: কোর্স ফিডব্যাক জমা দিন
ko: 코스 피드백 제출

source: Instructor Feedback
bn: প্রশিক্ষক ফিডব্যাক
ko: 강사 피드백

# rateInstructor
source: Rate the Instructor
bn: প্রশিক্ষক রেট করুন
ko: 강사 평가하기

source: Your Instructor Feedback
bn: আপনার প্রশিক্ষক ফিডব্যাক
ko: 귀하의 강사 피드백

# instructorFeedbackHint
source: Share your thoughts about teaching style, clarity, support...
bn: শিক্ষার ধরন, স্পষ্টতা, সহায়তা সম্পর্কে আপনার মতামত শেয়ার করুন...
ko: 교수 스타일, 명확성, 지원에 대한 생각을 공유하세요...

source: Submit Instructor Feedback
bn: প্রশিক্ষক ফিডব্যাক জমা দিন
ko: 강사 피드백 제출

source: Feedback Summary
bn: ফিডব্যাক সারাংশ
ko: 피드백 요약

source: Average Rating
bn: গড় রেটিং
ko: 평균 평점

source: Total Feedback
bn: মোট ফিডব্যাক
ko: 총 피드백

source: positive
bn: ইতিবাচক
ko: 긍정적

source: constructive
bn: গঠনমূলক
ko: 건설적

source: improvement
bn: উন্নতি
ko: 개선

# pleaseWriteCourseFeedback
source: Please write your course feedback
bn: অনুগ্রহ করে আপনার কোর্স ফিডব্যাক লিখুন
ko: 코스 피드백을 작성해 주세요

# pleaseRateCourse
source: Please provide a rating for the course
bn: অনুগ্রহ করে কোর্সের জন্য একটি রেটিং প্রদান করুন
ko: 코스에 대한 평가를 제공해 주세요

# courseFeedbackSubmitted
source: ✅ Course feedback submitted successfully!
bn: ✅ কোর্স ফিডব্যাক সফলভাবে জমা দেওয়া হয়েছে!
ko: ✅ 코스 피드백이 성공적으로 제출되었습니다!

# pleaseWriteInstructorFeedback
source: Please write your instructor feedback
bn: অনুগ্রহ করে আপনার প্রশিক্ষক ফিডব্যাক লিখুন
ko: 강사 피드백을 작성해 주세요

# pleaseRateInstructor
source: Please provide a rating for the instructor
bn: অনুগ্রহ করে প্রশিক্ষকের জন্য একটি রেটিং প্রদান করুন
ko: 강사에 대한 평가를 제공해 주세요

# instructorFeedbackSubmitted
source: ✅ Instructor feedback submitted successfully!
bn: ✅ প্রশিক্ষক ফিডব্যাক সফলভাবে জমা দেওয়া হয়েছে!
ko: ✅ 강사 피드백이 성공적으로 제출되었습니다!

# enrolledMembers
source: {count} enrolled members
bn: {count} জন তালিকাভুক্ত সদস্য
ko: {count}명의 수강생

# instructorRole
source: INSTRUCTOR
bn: প্রশিক্ষক
ko: 강사

# enrolledMembersTitle
source: Enrolled Members ({count})
bn: তালিকাভুক্ত সদস্যবৃন্দ ({count} জন)
ko: 등록된 수강생 ({count}명)

# videoNotFound
source: Video not found. The video URL may be invalid.
bn: ভিডিও খুঁজে পাওয়া যায়নি।
ko: 동영상을 찾을 수 없습니다.

# videoLoadingTimeout
source: Video loading timeout - Check your internet connection
bn: ভিডিও লোডিং টাইমআউট হয়েছে। আবার চেষ্টা করুন।
ko: 동영상 로딩이 시간 초과되었습니다. 다시 시도해 주세요.

# videoDuration
source: • Duration: {duration}
bn: সময়কাল: {duration}
ko: 재생시간: {duration}

# videoResolution
source: • Resolution: {resolution}
bn: রেজোলিউশন: {resolution}
ko: 해상도: {resolution}

# retryButton
source: Retry
bn: পুনরায় চেষ্টা
ko: 재시도

# videoLoaded
source: Loaded
bn: লোড হয়েছে
ko: 로드됨

# videoStatus
source: • Status: {status}
bn: • অবস্থা: {status}
ko: • 상태: {status}

source: Fullscreen mode
bn: ফুলস্ক্রিন মোড
ko: 전체 화면 모드

source: 🎬 Playback Settings:
bn: 🎬 প্লেব্যাক সেটিংস:
ko: 🎬 재생 설정:

# playbackSpeed
source: • Speed: {speed}x
bn: • গতি: {speed}x
ko: • 속도: {speed}x

# playbackQuality
source: • Quality: {quality}
bn: • গুণমান: {quality}
ko: • 품질: {quality}

# playbackVolume
source: • Volume: {volume}%
bn: • ভলিউম: {volume}%
ko: • 음량: {volume}%

# qualityAuto
source: Auto
bn: স্বয়ংক্রিয়
ko: 자동

# chatLearningLanguage
source: Learning {language}
bn: {language} শিখছেন
ko: {language} 학습 중

# chatLanguageEnthusiast
source: Language enthusiast from {country} {flag}. Love to practice languages and make new friends around the world!
bn: {country} {flag} থেকে একজন ভাষা উৎসাহী। ভাষা অনুশীলন করতে এবং সারা বিশ্বের নতুন বন্ধু তৈরি করতে ভালোবাসি!
ko: {country} {flag} 출신의 언어 애호가입니다. 언어를 연습하고 전 세계에서 새로운 친구를 만드는 것을 좋아합니다!

# chatCorrectedText
source: Corrected text
bn: সংশোধিত টেক্সট
ko: 수정된 텍스트

# chatTranslationHere
source: Translation here
bn: অনুবাদ এখানে
ko: 번역 내용

# chatRead
source: Read
bn: পড়েছেন
ko: 읽음

# chatMessageTranslated
source: Message translated!
bn: বার্তা অনুবাদ করা হয়েছে!
ko: 메시지가 번역되었습니다!

# chatCorrectMessage
source: Correct Message
bn: বার্তা সংশোধন করুন
ko: 메시지 수정

# chatOriginal
source: Original:
bn: মূল:
ko: 원문:

# chatCorrection
source: Correction:
bn: সংশোধন:
ko: 수정:

# chatCorrectionSaved
source: Correction saved!
bn: সংশোধন সংরক্ষিত হয়েছে!
ko: 수정이 저장되었습니다!

# chatDialogCorrectMessage
source: Correct Message
bn: বার্তা সংশোধন করুন
ko: 메시지 수정

# chatDialogOriginal
source: Original:
bn: মূল:
ko: 원문:

# chatDialogCorrection
source: Correction:
bn: সংশোধন:
ko: 수정:

# chatDialogCancel
source: Cancel
bn: বাতিল
ko: 취소

# chatDialogSave
source: Save
bn: সংরক্ষণ
ko: 저장

# chatDialogCorrectionSaved
source: Correction saved!
bn: সংশোধন সংরক্ষিত হয়েছে!
ko: 수정이 저장되었습니다!

# chatTranslateIconTapped
source: Translate icon tapped!
bn: অনুবাদ আইকন টেপ করা হয়েছে!
ko: 번역 아이콘이 탭되었습니다!

# chatCorrectIconTapped
source: Correct icon tapped!
bn: সংশোধন আইকন টেপ করা হয়েছে!
ko: 수정 아이콘이 탭되었습니다!

# chatDaysAgo
source: {count} days ago
bn: {count} দিন আগে
ko: {count}일 전

# chatHoursAgo
source: {count} hours ago
bn: {count} ঘণ্টা আগে
ko: {count}시간 전

# chatMinutesAgo
source: {count} minutes ago
bn: {count} মিনিট আগে
ko: {count}분 전

# chatTimestampDaysAgo
source: {count} days ago
bn: {count} দিন আগে
ko: {count}일 전

# chatTimestampHoursAgo
source: {count} hours ago
bn: {count} ঘন্টা আগে
ko: {count}시간 전

# chatTimestampMinutesAgo
source: {count} minutes ago
bn: {count} মিনিট আগে
ko: {count}분 전

# paymentCompletePurchase
source: Complete Purchase
bn: ক্রয় সম্পূর্ণ করুন
ko: 구매 완료

# paymentCourseFallback
source: Course
bn: কোর্স
ko: 과정

# paymentInstructorFallback
source: Instructor
bn: প্রশিক্ষক
ko: 강사

# paymentCourseBy
source: by {instructor}
bn: প্রশিক্ষক: {instructor}
ko: 강사: {instructor}

source: Payment Method
bn: পেমেন্ট পদ্ধতি
ko: 결제 방법

# paymentCreditDebitCard
source: Credit/Debit Card
bn: ক্রেডিট/ডেবিট কার্ড
ko: 신용/체크카드

# paymentPayPal
source: PayPal
bn: পেপাল
ko: 페이팔

# paymentCardInformation
source: Card Information
bn: কার্ডের তথ্য
ko: 카드 정보

# paymentCardNumber
source: Card Number
bn: কার্ড নম্বর
ko: 카드 번호

# paymentExpiryDate
source: Expiry Date
bn: মেয়াদ শেষের তারিখ
ko: 유효 기한

# paymentBillingInformation
source: Billing Information
bn: বিলিং তথ্য
ko: 청구 정보

# paymentCardholderName
source: Cardholder Name
bn: কার্ডধারীর নাম
ko: 카드 소유자 이름

# paymentCardholderNameHint
source: John Doe
bn: রহিম আহমেদ
ko: 김철수

# paymentEmailAddress
source: Email Address
bn: ইমেইল ঠিকানা
ko: 이메일 주소

# paymentEmailHint
source: john@example.com
bn: rahim@example.com
ko: kim@example.com

# paymentOrderSummary
source: Order Summary
bn: অর্ডার সারসংক্ষেপ
ko: 주문 요약

# paymentCoursePrice
source: Course Price
bn: কোর্সের দাম
ko: 과정 가격

# paymentTax
source: Tax (10%)
bn: কর (১০%)
ko: 세금 (10%)

# paymentTotal
source: Total
bn: মোট
ko: 총액

# paymentProcessing
source: Processing...
bn: প্রসেসিং...
ko: 처리 중...

# paymentPay
source: Pay {amount}
bn: {amount} পেমেন্ট
ko: {amount} 결제

# paymentProcessingPayPal
source: Processing PayPal payment...
bn: পেপাল পেমেন্ট প্রসেসিং...
ko: 페이팔 결제 처리 중...

# paymentSuccessTitle
source: Payment Successful!
bn: পেমেন্ট সফল!
ko: 결제 완료!

# paymentSuccessMessage
source: Welcome to {courseTitle}! You can now access all course materials.
bn: {courseTitle}-এ স্বাগতম! এখন আপনি সমস্ত কোর্স উপকরণ অ্যাক্সেস করতে পারবেন।
ko: {courseTitle}에 오신 것을 환영합니다! 이제 모든 강의 자료에 액세스할 수 있습니다.

# paymentStartLearning
source: Start Learning
bn: শেখা শুরু করুন
ko: 학습 시작

# paymentErrorCardNumber
source: Please enter card number
bn: দয়া করে কার্ড নম্বর প্রবেশ করান
ko: 카드 번호를 입력해주세요

# paymentErrorInvalidCard
source: Please enter a valid card number
bn: দয়া করে একটি বৈধ কার্ড নম্বর প্রবেশ করান
ko: 유효한 카드 번호를 입력해주세요

# paymentErrorRequired
source: Required
bn: প্রয়োজনীয়
ko: 필수

# paymentErrorInvalidDate
source: Invalid date
bn: অবৈধ তারিখ
ko: 잘못된 날짜

# paymentErrorInvalidCVV
source: Invalid CVV
bn: অবৈধ CVV
ko: 잘못된 CVV

# paymentErrorCardholderName
source: Please enter cardholder name
bn: দয়া করে কার্ডধারীর নাম প্রবেশ করান
ko: 카드 소유자 이름을 입력해주세요

# paymentErrorEmail
source: Please enter email address
bn: দয়া করে ইমেইল ঠিকানা প্রবেশ করান
ko: 이메일 주소를 입력해주세요

# paymentErrorInvalidEmail
source: Please enter a valid email
bn: অনুগ্রহ করে একটি বৈধ ইমেইল দিন
ko: 유효한 이메일을 입력해주세요

# courseDetailsFallbackTitle
source: Course Title
bn: কোর্সের শিরোনাম
ko: 코스 제목

# courseDetailsFallbackDescription
source: This is a comprehensive course designed to help you master the language.
bn: এটি একটি বিস্তৃত কোর্স যা আপনাকে ভাষায় দক্ষতা অর্জনে সাহায্য করার জন্য ডিজাইন করা হয়েছে।
ko: 이것은 언어를 마스터하는데 도움이 되도록 설계된 종합적인 과정입니다.

# courseDetailsFallbackLanguage
source: English
bn: বাংলা
ko: 한국어

# courseDetailsFallbackLevel
source: Beginner
bn: প্রাথমিক
ko: 초급

# courseDetailsFallbackInstructor
source: John Doe
bn: রহিম উদ্দিন
ko: 김철수

# courseDetailsFallbackDuration
source: 4 weeks
bn: ৪ সপ্তাহ
ko: 4주

# courseDetailsFallbackStatus
source: active
bn: সক্রিয়
ko: 활성

# courseDetailsFallbackCategory
source: Language
bn: ভাষা
ko: 언어

# courseDetailsInstructorBy
source: by {instructor}
bn: {instructor} দ্বারা
ko: {instructor}에 의한

# courseDetailsLanguageLabel
source: Language
bn: ভাষা
ko: 언어

# courseDetailsSessionsLabel
source: Sessions
bn: সেশন
ko: 세션

# courseDetailsStudentsLabel
source: Students
bn: শিক্ষার্থী
ko: 학생

# courseDetailsOverviewTitle
source: Course Overview
bn: কোর্স সংক্ষিপ্ত বিবরণ
ko: 코스 개요

# courseDetailsTimelineTitle
source: Course Timeline
bn: কোর্সের সময়সূচী
ko: 코스 일정

# courseDetailsStartDateLabel
source: Start Date
bn: শুরুর তারিখ
ko: 시작일

# courseDetailsEndDateLabel
source: End Date
bn: শেষের তারিখ
ko: 종료일

# courseDetailsDurationLevel
source: Duration: {duration} • Level: {level}
bn: সময়কাল: {duration} • স্তর: {level}
ko: 기간: {duration} • 레벨: {level}

# courseDetailsInstructorTitle
source: Expert Language Instructor
bn: বিশেষজ্ঞ ভাষা প্রশিক্ষক
ko: 전문 언어 강사

# courseDetailsInstructorDescription
source: Experienced educator with over 8 years of teaching experience. Specializes in modern language learning techniques.
bn: ৮ বছরেরও বেশি শিক্ষাদানের অভিজ্ঞতা সহ দক্ষ শিক্ষক। আধুনিক ভাষা শেখার কৌশলে বিশেষজ্ঞ।
ko: 8년 이상의 교육 경험을 가진 숙련된 교육자입니다. 현대적인 언어 학습 기법을 전문으로 합니다.

# courseDetailsInstructorYearsExp
source: Years Exp.
bn: অভিজ্ঞতার বছর
ko: 경력 연수

# courseDetailsInstructorRating
source: Rating
bn: রেটিং
ko: 평점

# courseDetailsInstructorStudents
source: Students
bn: শিক্ষার্থী
ko: 학생 수

# courseDetailsFeedbackTitle
source: Student Feedback
bn: শিক্ষার্থীদের মতামত
ko: 학생 피드백

# courseDetailsHighlyRated
source: Highly Rated Course
bn: উচ্চ রেটিং প্রাপ্ত কোর্স
ko: 높은 평가의 코스

# courseDetailsReviewsCount
source: Based on 124+ student reviews
bn: ১২৪+ শিক্ষার্থীর পর্যালোচনার ভিত্তিতে
ko: 124개 이상의 학생 리뷰 기반

# courseDetailsSatisfactionRate
source: 95% Satisfaction Rate
bn: ৯৫% সন্তুষ্টির হার
ko: 95% 만족도

# courseDetailsOneTimePayment
source: One-time Payment
bn: একবারের পেমেন্ট
ko: 일회성 결제

# courseDetailsEnrollNow
source: Enroll Now
bn: এখনই ভর্তি হন
ko: 지금 등록

# instructorProfile
source: Profile
bn: প্রোফাইল
ko: 프로필

# instructorYearsExp
source: {years} years experience
bn: {years} বছরের অভিজ্ঞতা
ko: {years}년 경력

# instructorStatsCourses
source: Courses
bn: কোর্স
ko: 코스

# instructorStatsStudents
source: Students
bn: শিক্ষার্থী
ko: 학생

# instructorStatsRating
source: Rating
bn: রেটিং
ko: 평점

# instructorPersonalInfo
source: Personal Information
bn: ব্যক্তিগত তথ্য
ko: 개인 정보

# instructorProfessionalInfo
source: Professional Information
bn: পেশাদার তথ্য
ko: 전문 정보

# instructorLanguages
source: Languages
bn: ভাষা
ko: 언어

# instructorAboutMe
source: About Me
bn: আমার সম্পর্কে
ko: 자기소개

# instructorEmail
source: Email
bn: ইমেইল
ko: 이메일

# instructorDateOfBirth
source: Date of Birth
bn: জন্ম তারিখ
ko: 생년월일

# instructorGender
source: Gender
bn: লিঙ্গ
ko: 성별

# instructorCountry
source: Country
bn: দেশ
ko: 국가

# instructorYearsOfExperience
source: Years of Experience
bn: অভিজ্ঞতার বছর
ko: 경력 연수

# instructorYearsFormat
source: {years} years
bn: {years} বছর
ko: {years}년

# instructorNativeLanguage
source: Native Language
bn: মাতৃভাষা
ko: 모국어

# instructorTeachingLanguage
source: Teaching Language
bn: শিক্ষণ ভাষা
ko: 교육 언어

# instructorEditProfileImage
source: Edit Profile Image
bn: প্রোফাইল ইমেজ সম্পাদনা
ko: 프로필 이미지 편집

# instructorTakePhoto
source: Take Photo
bn: ছবি তুলুন
ko: 사진 촬영

# instructorSelectFromGallery
source: Select from Gallery
bn: গ্যালারি থেকে নির্বাচন করুন
ko: 갤러리에서 선택

# instructorEnterImageUrl
source: Enter Image URL
bn: ইমেজ URL প্রবেশ করান
ko: 이미지 URL 입력

# instructorCameraFeatureMessage
source: Camera feature will be implemented
bn: ক্যামেরা ফিচার বাস্তবায়িত হবে
ko: 카메라 기능이 구현될 예정입니다

# instructorGalleryFeatureMessage
source: Gallery feature will be implemented
bn: গ্যালারি ফিচার বাস্তবায়িত হবে
ko: 갤러리 기능이 구현될 예정입니다

# instructorEditTitle
source: Edit {field}
bn: {field} সম্পাদনা
ko: {field} 편집

# instructorEnterField
source: Enter {field}
bn: {field} প্রবেশ করান
ko: {field} 입력

# instructorCancel
source: Cancel
bn: বাতিল
ko: 취소

# instructorSave
source: Save
bn: সংরক্ষণ
ko: 저장

# instructorFieldUpdated
source: {field} updated successfully
bn: {field} সফলভাবে আপডেট হয়েছে
ko: {field}이(가) 성공적으로 업데이트되었습니다

# instructorEditBio
source: Edit Bio
bn: জীবনী সম্পাদনা
ko: 자기소개 편집

# instructorBioPlaceholder
source: Tell us about yourself...
bn: আপনার সম্পর্কে বলুন...
ko: 당신에 대해 알려주세요...

# instructorBioUpdated
source: Bio updated successfully
bn: জীবনী সফলভাবে আপডেট হয়েছে
ko: 자기소개가 성공적으로 업데이트되었습니다

# instructorDateOfBirthUpdated
source: Date of birth updated successfully
bn: জন্ম তারিখ সফলভাবে আপডেট হয়েছে
ko: 생년월일이 성공적으로 업데이트되었습니다

# instructorSelectGender
source: Select Gender
bn: লিঙ্গ নির্বাচন করুন
ko: 성별 선택

# instructorGenderUpdated
source: Gender updated successfully
bn: লিঙ্গ সফলভাবে আপডেট হয়েছে
ko: 성별이 성공적으로 업데이트되었습니다

# instructorSelectCountry
source: Select Country
bn: দেশ নির্বাচন করুন
ko: 국가 선택

# instructorCountryUpdated
source: Country updated successfully
bn: দেশ সফলভাবে আপডেট হয়েছে
ko: 국가가 성공적으로 업데이트되었습니다
