Repository: shoyeb017/SayHello_App_Fullstack_
Catalog: frontend_sayhello_app/lib/l10n/app_*.arb
Languages: bn, ko

# instructorSelectNativeLanguage
source: Select Native Language
bn: মাতৃভাষা নির্বাচন করুন
ko: 모국어 선택

# instructorSelectTeachingLanguage
source: Select Teaching Language
bn: শিক্ষণ ভাষা নির্বাচন করুন
ko: 교육 언어 선택

# instructorNativeLanguageUpdated
source: Native language updated successfully
bn: মাতৃভাষা সফলভাবে আপডেট হয়েছে
ko: 모국어가 성공적으로 업데이트되었습니다

# instructorTeachingLanguageUpdated
source: Teaching language updated successfully
bn: শিক্ষণ ভাষা সফলভাবে আপডেট হয়েছে
ko: 교육 언어가 성공적으로 업데이트되었습니다

# instructorExperienceUpdated
source: Experience updated successfully
bn: অভিজ্ঞতা সফলভাবে আপডেট হয়েছে
ko: 경력이 성공적으로 업데이트되었습니다

# instructorLogout
source: Logout
bn: লগআউট
ko: 로그아웃

# instructorLogoutConfirm
source: Are you sure you want to logout?
bn: আপনি কি লগআউট করতে চান?
ko: 로그아웃 하시겠습니까?

source: Revenue Dashboard
bn: আয়ের ড্যাশবোর্ড
ko: 수익 대시보드

# revenueWeekly
source: Weekly
bn: সাপ্তাহিক
ko: 주간

# revenueMonthly
source: Monthly
bn: মাসিক
ko: 월간

# revenueThisYear
source: This Year
bn: এই বছর
ko: 올해

# revenueTotalCourses
source: Total Courses
bn: মোট কোর্স
ko: 총 과정 수

# revenueWeeklyTrend
source: Weekly Revenue Trend
bn: সাপ্তাহিক আয়ের প্রবণতা
ko: 주간 수익 동향

# revenueTotal
source: Total
bn: মোট
ko: 총액

# revenuePeak
source: Peak
bn: সর্বোচ্চ
ko: 최고점

# revenueCourseIncome
source: Course Income
bn: কোর্সের আয়
ko: 과정 수입

# revenueShowLess
source: Show Less
bn: কম দেখান
ko: 간단히 보기

# revenueViewAll
source: View All
bn: সব দেখুন
ko: 모두 보기

# revenuePrice
source: Price
bn: দাম
ko: 가격

# revenueEnrolled
source: enrolled
bn: নিবন্ধিত
ko: 등록됨

# revenueTransactionHistory
source: Transaction History
bn: লেনদেনের ইতিহাস
ko: 거래 내역

# revenueWithdrawal
source: Withdrawal
bn: প্রত্যাহার
ko: 출금

# revenuePaymentOverview
source: Payment Overview
bn: পেমেন্ট ওভারভিউ
ko: 결제 개요

# revenueAvailableBalance
source: Available Balance
bn: উপলব্ধ ব্যালেন্স
ko: 사용 가능한 잔액

# revenueWithdrawButton
source: Withdraw
bn: প্রত্যাহার
ko: 출금

# revenueTotalEarned
source: Total Earned
bn: মোট আয়
ko: 총 수익

# revenueWithdrawn
source: Withdrawn
bn: প্রত্যাহৃত
ko: 출금됨

source: Withdraw Money
bn: টাকা তুলুন
ko: 출금하기

source: Available Balance
bn: উপলব্ধ ব্যালেন্স
ko: 사용 가능한 잔액

source: Withdrawal Amount
bn: প্রত্যাহারের পরিমাণ
ko: 출금 금액

source: Enter amount to withdraw
bn: প্রত্যাহারের পরিমাণ লিখুন
ko: 출금할 금액을 입력하세요

source: Please enter withdrawal amount
bn: অনুগ্রহ করে প্রত্যাহারের পরিমাণ লিখুন
ko: 출금 금액을 입력해주세요

# pleaseEnterValidAmount
source: Please enter a valid amount
bn: অনুগ্রহ করে একটি বৈধ পরিমাণ লিখুন
ko: 유효한 금액을 입력해주세요

source: Amount must be greater than zero
bn: পরিমাণ শূন্যের চেয়ে বেশি হতে হবে
ko: 금액은 0보다 커야 합니다

source: Amount exceeds available balance
bn: পরিমাণ উপলব্ধ ব্যালেন্স অতিক্রম করেছে
ko: 금액이 사용 가능한 잔액을 초과합니다

# minimumWithdrawalAmountIs
source: Minimum withdrawal amount is $10
bn: সর্বনিম্ন প্রত্যাহারের পরিমাণ হল $১০
ko: 최소 출금 금액은 $10입니다

# quickAmountMax
source: Max
bn: সর্বোচ্চ
ko: 최대

source: Bank Information
bn: ব্যাংক তথ্য
ko: 은행 정보

source: Account Holder Name
bn: অ্যাকাউন্ট ধারকের নাম
ko: 계좌 명의인

source: Enter full name as on bank account
bn: ব্যাংক অ্যাকাউন্টে যেমন আছে তেমন সম্পূর্ণ নাম লিখুন
ko: 은행 계좌의 명의인 성명을 입력하세요

source: Please enter account holder name
bn: অনুগ্রহ করে অ্যাকাউন্ট ধারকের নাম লিখুন
ko: 계좌 명의인을 입력해주세요

source: Bank Name
bn: ব্যাংকের নাম
ko: 은행명

source: Enter your bank name
bn: আপনার ব্যাংকের নাম লিখুন
ko: 은행명을 입력하세요

source: Please enter bank name
bn: অনুগ্রহ করে ব্যাংকের নাম লিখুন
ko: 은행명을 입력해주세요

source: Account Number
bn: অ্যাকাউন্ট নম্বর
ko: 계좌번호

source: Enter your account number
bn: আপনার অ্যাকাউন্ট নম্বর লিখুন
ko: 계좌번호를 입력하세요

source: Please enter account number
bn: অনুগ্রহ করে অ্যাকাউন্ট নম্বর লিখুন
ko: 계좌번호를 입력해주세요

source: Account number must be at least 8 digits
bn: অ্যাকাউন্ট নম্বর কমপক্ষে ৮ সংখ্যার হতে হবে
ko: 계좌번호는 최소 8자리여야 합니다

source: Routing Number
bn: রাউটিং নম্বর
ko: 라우팅 번호

source: Enter 9-digit routing number
bn: ৯ সংখ্যার রাউটিং নম্বর লিখুন
ko: 9자리 라우팅 번호를 입력하세요

source: Please enter routing number
bn: অনুগ্রহ করে রাউটিং নম্বর লিখুন
ko: 라우팅 번호를 입력해주세요

source: Routing number must be 9 digits
bn: রাউটিং নম্বর ৯ সংখ্যার হতে হবে
ko: 라우팅 번호는 9자리여야 합니다

source: Submit Withdrawal Request
bn: প্রত্যাহারের অনুরোধ জমা দিন
ko: 출금 신청 제출

source: Important Information
bn: গুরুত্বপূর্ণ তথ্য
ko: 중요한 정보

# processingTime
source: Processing time: 3-5 business days
bn: প্রক্রিয়াকরণের সময়: ৩-৫ কার্যদিবস
ko: 처리 시간: 3-5 영업일

# minimumWithdrawal
source: Minimum withdrawal: $10
bn: সর্বনিম্ন প্রত্যাহার: $১০
ko: 최소 출금액: $10

source: No processing fees
bn: কোন প্রক্রিয়াকরণ ফি নেই
ko: 처리 수수료 없음

# withdrawalsProcessedMondayFriday
source: Withdrawals are processed Monday-Friday
bn: প্রত্যাহার সোমবার থেকে শুক্রবার প্রক্রিয়া করা হয়
ko: 출금은 월요일부터 금요일까지 처리됩니다

# bankInformationEncrypted
source: Bank information is encrypted and secure
bn: ব্যাংক তথ্য এনক্রিপ্ট করা এবং নিরাপদ
ko: 은행 정보는 암호화되어 안전합니다

source: Confirm Withdrawal
bn: প্রত্যাহার নিশ্চিত করুন
ko: 출금 확인

# withdrawToAccountEndingIn
source: Withdraw
bn: দিয়ে শেষ হওয়া অ্যাকাউন্টে
ko: 로 끝나는 계좌로

# withdrawConfirmationQuestion
source: to your account ending in
bn: প্রত্যাহার করবেন?
ko: 을(를) 출금하시겠습니까?

source: Confirm
bn: নিশ্চিত করুন
ko: 확인

source: Withdrawal request submitted successfully!
bn: প্রত্যাহারের অনুরোধ সফলভাবে জমা দেওয়া হয়েছে!
ko: 출금 신청이 성공적으로 제출되었습니다!

source: Create New Course
bn: নতুন কোর্স তৈরি করুন
ko: 새 코스 만들기

source: Create Your Course
bn: আপনার কোর্স তৈরি করুন
ko: 코스 만들기

# fillDetailsToCreateCourse
source: Fill in the details to create your course
bn: আপনার কোর্স তৈরি করার জন্য বিস্তারিত পূরণ করুন
ko: 코스를 만들기 위한 세부 정보를 입력하세요

source: Enter course title
bn: কোর্সের শিরোনাম লিখুন
ko: 코스 제목을 입력하세요

source: Please enter course title
bn: অনুগ্রহ করে কোর্সের শিরোনাম লিখুন
ko: 코스 제목을 입력해 주세요

source: Description
bn: বিবরণ
ko: 설명

# describeCourse
source: Describe your course
bn: আপনার কোর্স বর্ণনা করুন
ko: 코스를 설명해 주세요

source: Please enter course description
bn: অনুগ্রহ করে কোর্সের বিবরণ লিখুন
ko: 코스 설명을 입력해 주세요

# totalSessionsHint
source: e.g., 12
bn: যেমন: ১২
ko: 예: 12

source: Enter sessions
bn: সেশন সংখ্যা লিখুন
ko: 세션 수 입력

# priceInDollars
source: Price ($)
bn: দাম ($)
ko: 가격 ($)

source: Free
bn: বিনামূল্যে
ko: 무료

source: Course Schedule
bn: কোর্সের সময়সূচী
ko: 코스 일정

source: Select Date *
bn: তারিখ নির্বাচন করুন *
ko: 날짜 선택 *

source: Course Thumbnail
bn: কোর্স থাম্বনেইল
ko: 강의 썸네일

source: Select Course Thumbnail
bn: কোর্স থাম্বনেইল নির্বাচন করুন
ko: 코스 썸네일 선택

source: JPG, PNG (Max 5MB)
bn: JPG, PNG (সর্বোচ্চ 5MB)
ko: JPG, PNG (최대 5MB)

source: Image Selected
bn: ছবি নির্বাচিত
ko: 이미지 선택됨

source: Publish Course
bn: কোর্স প্রকাশ করুন
ko: 코스 게시

# pleaseSelectStartEndDates
source: Please select start and end dates
bn: অনুগ্রহ করে শুরু এবং শেষের তারিখ নির্বাচন করুন
ko: 시작일과 종료일을 선택해 주세요

# pleaseSelectCourseThumbnail
source: Please select a course thumbnail
bn: অনুগ্রহ করে একটি কোর্স থাম্বনেইল নির্বাচন করুন
ko: 코스 썸네일을 선택해 주세요

source: Course published successfully!
bn: কোর্স সফলভাবে প্রকাশিত হয়েছে!
ko: 코스가 성공적으로 게시되었습니다!

source: Image picker feature will be implemented
bn: ছবি নির্বাচন বৈশিষ্ট্য বাস্তবায়িত হবে
ko: 이미지 선택 기능이 구현될 예정입니다

source: Analytics
bn: বিশ্লেষণ
ko: 분석

source: Search your courses...
bn: আপনার কোর্স খুঁজুন...
ko: 강의 검색...

source: Total Students
bn: মোট শিক্ষার্থী
ko: 총 학생 수

source: Active Courses
bn: সক্রিয় কোর্স
ko: 진행중인 강의

source: Total Courses
bn: মোট কোর্স
ko: 총 강의 수

source: Upcoming Courses
bn: আসন্ন কোর্স
ko: 예정된 강의

source: See all
bn: সব দেখুন
ko: 모두 보기

source: Completed Courses
bn: সম্পন্ন কোর্স
ko: 완료된 강의

source: Show all sections
bn: সব বিভাগ দেখান
ko: 모든 섹션 보기

# tryAdjustingSearch
source: Try adjusting your search terms
bn: আপনার অনুসন্ধান শর্তাবলী সামঞ্জস্য করার চেষ্টা করুন
ko: 검색어를 조정해 보세요

source: Instructor Portal
bn: প্রশিক্ষক পোর্টাল
ko: 강사 포털

source: Instructor Settings
bn: প্রশিক্ষক সেটিংস
ko: 강사 설정

source: Completion
bn: সমাপ্তি
ko: 완료율

source: Notification Preferences
bn: বিজ্ঞপ্তি পছন্দসমূহ
ko: 알림 설정

source: Office Hours
bn: অফিস আওয়ার
ko: 상담 시간

# languageAndRegion
source: Language & Region
bn: ভাষা এবং অঞ্চল
ko: 언어 및 지역

source: Close
bn: বন্ধ করুন
ko: 닫기

source: Notification settings coming soon
bn: বিজ্ঞপ্তি সেটিংস শীঘ্রই আসছে
ko: 알림 설정이 곧 제공됩니다

source: Office hours settings coming soon
bn: অফিস আওয়ার সেটিংস শীঘ্রই আসছে
ko: 상담 시간 설정이 곧 제공됩니다

source: Language settings coming soon
bn: ভাষা সেটিংস শীঘ্রই আসছে
ko: 언어 설정이 곧 제공됩니다

# studentsCount
source: students
bn: শিক্ষার্থী
ko: 학생

# coursesStudents
source: Students
bn: শিক্ষার্থী
ko: 학생

source: Category
bn: বিভাগ
ko: 카테고리

source: Starts
bn: শুরু
ko: 시작

source: Revenue Analytics
bn: আয় বিশ্লেষণ
ko: 수익 분석

source: Course Price
bn: কোর্সের মূল্য
ko: 강의 가격

source: Total Revenue
bn: মোট আয়
ko: 총 수익

source: Course Management
bn: কোর্স ব্যবস্থাপনা
ko: 강의 관리

source: Edit Course Details
bn: কোর্সের বিস্তারিত সম্পাদনা করুন
ko: 강의 세부사항 편집

# editCourseDetailsTitle
source: Edit Course Details
bn: কোর্সের বিস্তারিত সম্পাদনা করুন
ko: 강의 세부사항 편집

source: Title
bn: শিরোনাম
ko: 제목

# priceWithSymbol
source: Price ($)
bn: মূল্য ($)
ko: 가격 ($)

source: Thumbnail URL
bn: থাম্বনেইল URL
ko: 썸네일 URL

source: Save Changes
bn: পরিবর্তনসমূহ সংরক্ষণ করুন
ko: 변경 사항 저장

source: Course details updated successfully
bn: কোর্সের বিস্তারিত সফলভাবে আপডেট হয়েছে
ko: 강의 세부사항이 성공적으로 업데이트되었습니다

source: Feedback Management
bn: ফিডব্যাক ব্যবস্থাপনা
ko: 피드백 관리

# viewStudentReviewsDescription
source: View student reviews and provide personalized feedback
bn: শিক্ষার্থীদের পর্যালোচনা দেখুন এবং ব্যক্তিগত ফিডব্যাক প্রদান করুন
ko: 학생 리뷰를 보고 개인화된 피드백을 제공하세요

source: Course Rating
bn: কোর্স রেটিং
ko: 강의 평점

source: Total Reviews
bn: মোট পর্যালোচনা
ko: 총 리뷰 수

source: Course Reviews from Students
bn: শিক্ষার্থীদের কোর্স পর্যালোচনা
ko: 학생들의 강의 리뷰

source: Instructor Reviews from Students
bn: শিক্ষার্থীদের প্রশিক্ষক পর্যালোচনা
ko: 학생들의 강사 리뷰

source: Give Student Feedback
bn: শিক্ষার্থীকে ফিডব্যাক দিন
ko: 학생 피드백 제공

source: Select Student
bn: শিক্ষার্থী নির্বাচন করুন
ko: 학생 선택

source: Choose a student...
bn: একজন শিক্ষার্থী বেছে নিন...
ko: 학생을 선택하세요...

source: Rate Student Performance
bn: শিক্ষার্থীর কর্মক্ষমতা মূল্যায়ন করুন
ko: 학생 성과 평가

source: Feedback Message
bn: ফিডব্যাক বার্তা
ko: 피드백 메시지

# feedbackHintText
source: Share your feedback about student's performance, participation, areas for improvement...
bn: শিক্ষার্থীর কর্মক্ষমতা, অংশগ্রহণ, উন্নতির ক্ষেত্র সম্পর্কে আপনার ফিডব্যাক শেয়ার করুন...
ko: 학생의 성과, 참여도, 개선점에 대한 피드백을 공유하세요...

source: Send Feedback to Student
bn: শিক্ষার্থীকে ফিডব্যাক পাঠান
ko: 학생에게 피드백 보내기

source: Please write your feedback
bn: অনুগ্রহ করে আপনার ফিডব্যাক লিখুন
ko: 피드백을 작성해주세요

source: Please provide a rating
bn: অনুগ্রহ করে একটি রেটিং প্রদান করুন
ko: 평점을 제공해주세요

# feedbackSentSuccessfully
source: ✅ Feedback sent to {studentName} successfully!
bn: ✅ {studentName} এর কাছে ফিডব্যাক সফলভাবে পাঠানো হয়েছে!
ko: ✅ {studentName}에게 피드백이 성공적으로 전송되었습니다!

source: Instructor Panel
bn: প্রশিক্ষক প্যানেল
ko: 강사 패널

# onlineStudentsCount
source: {onlineCount} online • {totalCount} total students
bn: {onlineCount}জন অনলাইন • মোট {totalCount}জন শিক্ষার্থী
ko: {onlineCount}명 온라인 • 총 {totalCount}명 학생

source: Message your students...
bn: আপনার শিক্ষার্থীদের বার্তা পাঠান...
ko: 학생들에게 메시지 보내기...

source: Schedule New Session
bn: নতুন সেশন সময়সূচি করুন
ko: 새 세션 예약하기

source: Session Overview
bn: সেশন ওভারভিউ
ko: 세션 개요

source: No sessions scheduled
bn: কোন সেশন সময়সূচিবদ্ধ নেই
ko: 예약된 세션이 없습니다

source: Create your first session
bn: আপনার প্রথম সেশন তৈরি করুন
ko: 첫 번째 세션을 만들어보세요

source: Schedule Session
bn: সেশন সময়সূচি করুন
ko: 세션 예약하기

source: Copy Link
bn: লিংক কপি করুন
ko: 링크 복사

source: Copy Password
bn: পাসওয়ার্ড কপি করুন
ko: 비밀번호 복사

source: Start
bn: শুরু
ko: 시작

source: Delete Session
bn: সেশন মুছুন
ko: 세션 삭제

# deleteSessionConfirmation
source: Are you sure you want to delete this session? This action cannot be undone.
bn: আপনি কি নিশ্চিত যে আপনি এই সেশনটি মুছে ফেলতে চান? এই কাজটি পূর্বাবস্থায় ফেরানো যাবে না।
ko: 이 세션을 삭제하시겠습니까? 이 작업은 되돌릴 수 없습니다.

source: Session deleted successfully
bn: সেশন সফলভাবে মুছে ফেলা হয়েছে
ko: 세션이 성공적으로 삭제되었습니다

source: Session Title
bn: সেশন শিরোনাম
ko: 세션 제목

# sessionTitleRequired
source: Session Title *
bn: সেশন শিরোনাম *
ko: 세션 제목 *

source: Platform
bn: প্ল্যাটফর্ম
ko: 플랫폼

# platformRequired
source: Platform *
bn: প্ল্যাটফর্ম *
ko: 플랫폼 *

source: Select Time *
bn: সময় নির্বাচন করুন *
ko: 시간 선택 *

# durationHours
source: Duration: {duration} hours
bn: সময়কাল: {duration} ঘন্টা
ko: 지속 시간: {duration}시간

# sessionLinkRequired
source: Session Link *
bn: সেশন লিংক *
ko: 세션 링크 *

source: Password (optional)
bn: পাসওয়ার্ড (ঐচ্ছিক)
ko: 비밀번호 (선택사항)

source: Session scheduled successfully!
bn: সেশন সফলভাবে সময়সূচিবদ্ধ হয়েছে!
ko: 세션이 성공적으로 예약되었습니다!

# fillAllRequiredFields
source: Please fill in all required fields
bn: দয়া করে সব প্রয়োজনীয় ক্ষেত্র পূরণ করুন
ko: 모든 필수 필드를 입력해주세요

source: Edit Session
bn: সেশন সম্পাদনা করুন
ko: 세션 편집

source: Update
bn: আপডেট
ko: 업데이트

source: Session updated successfully!
bn: সেশন সফলভাবে আপডেট হয়েছে!
ko: 세션이 성공적으로 업데이트되었습니다!

# startingSession
source: Starting {platform} session...
bn: {platform} সেশন শুরু করা হচ্ছে...
ko: {platform} 세션을 시작하고 있습니다...

source: Upload New Video
bn: নতুন ভিডিও আপলোড করুন
ko: 새 동영상 업로드

# completePercentage
source: {percentage}% complete
bn: {percentage}% সম্পন্ন
ko: {percentage}% 완료

# videosProcessed
source: {loaded} of {total} videos processed
bn: {loaded} এর মধ্যে {total} ভিডিও প্রক্রিয়াকৃত
ko: {loaded}/{total} 동영상 처리됨

source: No recorded videos yet
bn: এখনও কোনো রেকর্ড করা ভিডিও নেই
ko: 녹화된 동영상이 아직 없습니다

source: Upload your first recorded class
bn: আপনার প্রথম রেকর্ড করা ক্লাস আপলোড করুন
ko: 첫 번째 녹화 수업을 업로드하세요

source: Edit Video Details
bn: ভিডিও বিবরণ সম্পাদনা করুন
ko: 동영상 세부사항 편집

source: ✅ Video updated successfully!
bn: ✅ ভিডিও সফলভাবে আপডেট হয়েছে!
ko: ✅ 동영상이 성공적으로 업데이트되었습니다!

source: Delete Video
bn: ভিডিও মুছুন
ko: 동영상 삭제

# areYouSureDeleteVideo
source: Are you sure you want to delete this video?
bn: আপনি কি নিশ্চিত যে এই ভিডিওটি মুছতে চান?
ko: 이 동영상을 삭제하시겠습니까?

source: This action cannot be undone.
bn: এই কাজটি পূর্বাবস্থায় ফেরানো যাবে না।
ko: 이 작업은 되돌릴 수 없습니다.

# videoDeleted
source: 🗑️ "{title}" deleted
bn: 🗑️ "{title}" মুছে দেওয়া হয়েছে
ko: 🗑️ "{title}" 삭제됨

# uploadNewVideoDialog
source: Upload New Video
bn: নতুন ভিডিও আপলোড করুন
ko: 새 동영상 업로드

# tapToSelectVideoFile
source: Tap to select video file from storage
bn: স্টোরেজ থেকে ভিডিও ফাইল নির্বাচন করতে ট্যাপ করুন
ko: 저장소에서 동영상 파일을 선택하려면 탭하세요

# fileSelectedPrefix
source: File selected: {filename}
bn: নির্বাচিত ফাইল: {filename}
ko: 선택된 파일: {filename}

# fileSelected
source: 📁 File selected: {filename}
bn: 📁 নির্বাচিত ফাইল: {filename}
ko: 📁 선택된 파일: {filename}

# videoTitleRequired
source: Video Title *
bn: ভিডিও শিরোনাম *
ko: 동영상 제목 *

# uploadButton
source: Upload
bn: আপলোড
ko: 업로드

# uploadingVideo
source: 📤 Uploading "{title}"...
bn: 📤 "{title}" আপলোড করা হচ্ছে...
ko: 📤 "{title}" 업로드 중...

# videoPublishedSuccessfully
source: ✅ "{title}" published successfully!
bn: ✅ "{title}" সফলভাবে প্রকাশিত হয়েছে!
ko: ✅ "{title}"이 성공적으로 게시되었습니다!

# metadataError
source: Metadata error: {error}
bn: মেটাডেটা ত্রুটি: {error}
ko: 메타데이터 오류: {error}

source: Upload Study Material
bn: অধ্যয়ন উপকরণ আপলোড করুন
ko: 학습 자료 업로드

source: No study materials yet
bn: এখনও কোন অধ্যয়ন উপকরণ নেই
ko: 아직 학습 자료가 없습니다

source: Upload your first study material
bn: আপনার প্রথম অধ্যয়ন উপকরণ আপলোড করুন
ko: 첫 번째 학습 자료를 업로드하세요

source: ❌ No file available for this material
bn: ❌ এই উপকরণের জন্য কোন ফাইল উপলব্ধ নেই
ko: ❌ 이 자료에 사용할 수 있는 파일이 없습니다

# openingFile
source: 📁 Opening file: {fileName}
bn: 📁 ফাইল খোলা হচ্ছে: {fileName}
ko: 📁 파일 열기: {fileName}

source: File Preview
bn: ফাইল পূর্বরূপ
ko: 파일 미리보기

# fileLabel
source: File: {fileName}
bn: ফাইল: {fileName}
ko: 파일: {fileName}

# sizeLabel
source: Size: {fileSize}
bn: আকার: {fileSize}
ko: 크기: {fileSize}

# typeLabel
source: Type: {fileType}
bn: ধরন: {fileType}
ko: 유형: {fileType}

# inRealAppDescription
source: In real app, this would show the actual file content
bn: প্রকৃত অ্যাপে, এটি প্রকৃত ফাইল কন্টেন্ট দেখাবে
ko: 실제 앱에서는 여기에 실제 파일 내용이 표시됩니다

source: Open File
bn: ফাইল খুলুন
ko: 파일 열기

# openingFileWithSystemViewer
source: 📂 Opening {fileName} with system viewer
bn: 📂 সিস্টেম ভিউয়ার দিয়ে {fileName} খোলা হচ্ছে
ko: 📂 시스템 뷰어로 {fileName} 열기

source: Edit Material Details
bn: উপকরণের বিস্তারিত সম্পাদনা করুন
ko: 자료 세부정보 편집

source: ✅ Material updated successfully!
bn: ✅ উপকরণ সফলভাবে আপডেট হয়েছে!
ko: ✅ 자료가 성공적으로 업데이트되었습니다!

source: Delete Material
bn: উপকরণ মুছুন
ko: 자료 삭제

# areYouSureDeleteMaterial
source: Are you sure you want to delete this material?
bn: আপনি কি এই উপকরণটি মুছে ফেলতে চান?
ko: 이 자료를 삭제하시겠습니까?

# materialDeleted
source: 🗑️ "{materialTitle}" deleted
bn: 🗑️ "{materialTitle}" মুছে ফেলা হয়েছে
ko: 🗑️ "{materialTitle}"이 삭제되었습니다

# selectFileType
source: Select {fileType} File
bn: {fileType} ফাইল নির্বাচন করুন
ko: {fileType} 파일 선택

# chooseFileFromDevice
source: Choose a file from your device:
bn: আপনার ডিভাইস থেকে একটি ফাইল নির্বাচন করুন:
ko: 장치에서 파일을 선택하세요:

source: No file selected
bn: কোন ফাইল নির্বাচিত হয়নি
ko: 선택된 파일이 없습니다

source: Choose File
bn: ফাইল নির্বাচন করুন
ko: 파일 선택

source: Change File
bn: ফাইল পরিবর্তন করুন
ko: 파일 변경

# titleRequired
source: Title *
bn: শিরোনাম *
ko: 제목 *

source: File Type
bn: ফাইলের ধরন
ko: 파일 유형

source: Upload
bn: আপলোড
ko: 업로드

# materialUploadedSuccessfully
source: ✅ "{materialTitle}" uploaded successfully!
bn: ✅ "{materialTitle}" সফলভাবে আপলোড হয়েছে!
ko: ✅ "{materialTitle}"이 성공적으로 업로드되었습니다!

# studyMaterialFor
source: Study material for {courseTitle}
bn: {courseTitle} এর জন্য অধ্যয়ন উপকরণ
ko: {courseTitle} 학습 자료
